[{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed757"
  },
  "article": "12 Hidden iPhone Features More People Should Be Using",
  "important": true,
  "author": "Nelson Aguilar",
  "publishing_time": "2023-03-17T06:15:00Z",
  "image": "https://www.cnet.com/a/img/resize/3a2482b6ed2d098e923a1f76f5c49329e09f8e32/hub/2022/09/14/673fbd21-614e-4801-859f-39dc0b415a6c/apple-iphone-14-8188.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "Discover what your iPhone is capable of with these lesser-known iOS features and settings.\n<br><br>\nApple released iOS 16 last fall, so we've had over six months to explore the latest iPhone software update, yet there are always features, settings and tricks to discover. They may not be quite as popular as the newly customizable lock screen or the ability to unsend texts and emails, but they're still worth exploring if you want to become a pro iPhone user.\n<br><br>\nI'm going to walk you through everything you need to know about the best hidden gems in iOS 16, like password-protected photo albums, easily accessible Wi-Fi passwords and more.\nAnd while you're here, make sure you also brush up on the major new iOS 16 features you'll love, and a few that you might just hate (luckily, there's a fix).\n<br><br>\nView and share saved Wi-Fi passwords \nApple has allowed iOS users to share Wi-Fi passwords for a while now, but only by placing two Apple devices near each other. And if that feature didn't automatically work, you couldn't just dig out the password from your settings. Plus if you wanted to share a saved Wi-Fi password with someone else, like an Android user or someone on a computer, you had to remember the password. Until now.\n<br><br>\nIn Settings, go to Wi-Fi and tap the tiny information icon to the right of the network you want the password for. To view the network password, tap the Password section and then use Face ID or enter your passcode to view it. You can then tap Copy to copy the password into your clipboard and share it.\n<br><br>\nFind and remove duplicate photos and videos\nMaybe you've saved the same photo multiple times or downloaded a video more than once, resulting in duplicates littering up your photo album. It may not be a problem if you've got storage to spare, but you're running out of space, you can now remove every single duplicate easily with iOS 16.\n<br><br>\nIn Photos > Albums, you should see a new Duplicates album under Utilities. Apple scans through all of your photos and shows you any photo or video you've saved more than once in that album. From there, you can either delete any duplicates, or simply press Merge, which will keep the photo with the highest quality (and relevant data) and then move the others to the trash.\nAlthough you'll probably want to go through each set of duplicates, to ensure that they're actually exact copies and not similar photos, you can also hit Select > Select All > Merge to remove every single photo and video that Apple thinks is a duplicate, all at once.\n<br><br>\nHang up a phone or FaceTime call with Siri\nSiri does a lot of things. You can use the virtual assistant to send a text message, get directions or play music -- but one thing she's never been able to do is hang up a phone call. Weird right? Now that's finally a possibility with iOS 16.\n<br><br>\nIn Settings, go to Siri & Search and first make sure Listen for 'Hey Siri' is toggled on. If it is, you should see a new option underneath -- Call Hang Up. Go into that option and toggle on Call Hang Up. When you're on a phone call or FaceTime video chat, simply say, 'Hey, Siri,' and ask her to hang up your current call.\nPair Nintendo Switch Joy-Cons with your iPhone\nApple has long allowed you to pair third-party controllers, like the PS5 Sony DualSense and Xbox Core Controller, to your iPhone and iPad, in order to more comfortably play mobile video games like the Apple Arcade library, Minecraft and Call of Duty. Now you can add another console controller to that list.\n<br><br>\nIf you own a Nintendo Switch, you can now pair your Joy-Con controllers to your iPhone or iPad running iOS 16. To start, hold down the little black pairing button on the Joy-Con, until the green lights start running back and forth. This means the device is in pairing mode. Next, open your iPhone and go to Settings > Bluetooth and select the Joy-Con from the list. Repeat this step with the other Joy-Con.\nHidden and Recently Deleted albums are now password protected\nThe Hidden album in the Photos app is clearly not hidden, seeing as anyone can easily find it. That makes it impractical for adequately hiding private photos and videos. While Apple does have an option to make the Hidden album 'invisible,' anyone with access to your phone could make it visible again and view everything inside.\n<br><br>\nThanks to iOS 16, you can now lock the Hidden album. You don't actually need to do anything to toggle this feature on. If you want to check it out, launch the Photos app and go to the Albums tab at the bottom of the screen. If you scroll down, you'll see a tiny lock next to the Hidden and Recently Deleted albums. To view the contents of those albums, you'll need to use Face ID or your passcode.\nCopy and paste photo and video edits\nIf you use the editor tool in the Photos app, you'll be happy to learn that you can now copy and paste edits, including saturation, contrast and brightness, between photos. If you edit one photo or video and are happy with the look, you can paste those same exact edits to any other photo or video in your camera roll.\n<br><br>\nTo do this, launch the Photos app and open a photo that's been edited in full-screen. Next, tap on the three-dot menu in the top-right corner and then hit Copy Edits. This option will only appear if the photo has been edited within Photos, not any third-party photo editor. Finally, go to the photo you want to copy these edits over to, tap on the three-dot menu and then hit Paste Edits. After a second or so, you should see the photo edits appear.\n<br><br>\nUse Siri to send an emoji\nSiri has long been able to send long, complicated text messages and emails by dictation, but with iOS 16, for the first time, you're now able to use your voice to send emojis. As long as you know the name of the emoji, simply say 'face with tears of joy emoji' or 'red heart emoji' to insert an emoji into your text with Siri.\n<br><br>\nIf you use the keyboard dictation feature in your iPhone's keyboard, accessible at the bottom right of your keyboard (microphone icon), you can also say the emoji name to insert an emoji anywhere you can type text, like in a note or a caption on Instagram.\nBring haptic feedback to your keyboard\nThe iPhone has long had haptic feedback. It's what you feel underneath your fingertips whenever you attempt to delete an app from your home screen or enter the incorrect password on your lock screen. Strangely enough, haptic feedback has never been available for the stock iOS keyboard -- until now.\n<br><br>\nIf you want to enable a slight vibration for every single key you type in, go to Settings > Sounds & Haptics > Keyboard Feedback and toggle on Haptic. The sound option you see is the loud and annoying clacking sound you might hear when you type in something and your phone isn't on silent mode, so you can keep that disabled.\n<br><br>\nPin your favorite tabs in Safari\nSafari caps your open tabs at 500, and if you're nearing that limit, it might be pretty darn hard to find the exact tab you're looking for. You could scroll endlessly, but there's now an easier way to find the exact tab you're looking for.\n<br><br>\nIn Safari, if you press down on an open tab, you now have the option to hit Pin Tab. This will move that tab to the top of Safari, where it will exist as a tiny tab preview, permanently pinned there, which you can then tap to view. If you press down and unpin a tab, it will move to first in your grid of open tabs.\n<br><br>\nUse Face ID while you're lying down\nIf you've ever tried to unlock your iPhone while it's vertical, like when you're lying on your side, you might have noticed that it doesn't work. You have to place your iPhone in portrait orientation, or upright, for Face ID to work. With iOS 16, you can finally use Face ID to unlock your iPhone when it's in landscape orientation. However, for this to work, you must have an iPhone 13 or 14 running iOS 16.\n<br><br>\nCopy your screenshots to your clipboard without saving them\nYou don't need to save a screenshot to your photo album to share it with someone else. A new iOS 16 feature allows you to take a screenshot, copy it to your clipboard, delete it from your phone and paste it where you see fit. After you take a screenshot, tap the screenshot preview that appears, hit Done on the top-right and then tap Copy and Delete to copy the screenshot to your clipboard.\n<br><br>\nRemove more preinstalled Apple apps \nSince iOS 10, you've been able to remove some preinstalled iOS applications like Stocks, Maps and Calculator -- but not all of them. With the release of iOS 16, you can add three more apps to this list of ones you can remove: Find My, Clock and Health. However, deleting these apps can negatively affect and break support with other apps and connected devices, like your Apple Watch."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed753"
  },
  "article": "ChatGPT Can Pass the Bar Exam Now. So What?",
  "important": true,
  "author": "Daniel Van Boom",
  "publishing_time": "2023-03-17T05:00:00Z",
  "image": "https://www.cnet.com/a/img/resize/ebbbce19e935a75b2158f528ee11cd13687a647e/hub/2023/03/17/714c765e-dba9-43a3-ad3a-3a5c196aa116/gettyimages-1248378294.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "Commentary: We already know machines can store more information than humans. The question is what happens next.\n<br><br>\nWhen I was studying journalism at university, we had an assignment called News Day, designed to replicate a day in the life of a reporter. You arrived at school in the morning and were assigned a story to be filed by the end of the day. I've forgotten what my specific story assignment was -- it was 12 years ago -- only that it had something to do with climate change. What I do remember, with painful lucidity, is an interview with an academic who'd agreed to help me. \n<br><br>\nAfter about 10 minutes, he correctly intuited from my questions that I didn't understand the issue, whatever it was. He told me to call him back after I'd done more research. It's been 12 years and I still remember that incident every time I conduct an interview. Something like that has yet to happen again, probably because fear of a repeat has compelled me to do more than the minimum research possible.\n<br><br>\nJournalism units made up one third of my communications degree. These units were designed to be as practical as possible, to mimic actual journalism. Beyond being completely owned by that environmental science professor, I remember getting practical tips about who does and doesn't make a good source, how to structure long-form feature articles and how to pitch articles to an editor. \n<br><br>\nOn the flip side, I remember almost nothing from my communications classes, which were made up of impractically dense texts and essays on topics like 'language and discourse.' It's a blur. \n<br><br>\nChatGPT would have passed these communications classes with ease. On Tuesday, OpenAI announced that, thanks to a new update, its ChatGPT chatbot is now smart enough to not only pass the bar exam, but score in the top 10%. \n<br><br>\nIt's easy to react to that with fear or awe. I certainly had a moment of undirected dread. But ChatGPT technically being qualified to practice law is not necessarily a sign of the AI apocalypse. It may even be a good thing.\n<br><br>\nIt pays to remember what the premise of a large-language-model AI like ChatGPT is to begin with. It's an artificial intelligence trained on enormous troves of data, from webpages to scholarly texts, which then uses a complex predictive mechanism to generate human-sounding text. It's amazing, and ChatGPT is impressive for being able to ace such a high-level challenge as the bar exam. But it's not the paradigm shift it may sound like.\n<br><br>\nExams are performances. They don't test how knowledgeable students are -- they test how much students can cram into their brain and regurgitate for a few hours. Much of that information is subsequently forgotten, often with glee. Exams are closer to tests of dedication than they are of knowledge. Of course humans can't compete with software when it comes to aggregating information. But that's not the point of an exam.\n<br><br>\nExams as a format are still relatively safe, especially if schools revert to the good ol' pen and page. Homework and college essays are on flimsier ground. \n<br><br>\nChatGPT has scared many educators. Students in New York and Los Angeles are banned from using the app, as are kids in many Australian high schools. Prestigious universities, including Oxford and Cambridge, have also banned your friendly neighborhood chatbot.\n<br><br>\nEducators fretting about new technology is an old story. In the 1970s some worried calculators would ruin math, but in fact they facilitated the teaching of more complicated equations. AI like ChatGPT can do a lot of homework, but so can Google. AI is flashier and more sophisticated, but it's hardly a new threat. Teachers are now asking kids not to cheat using ChatGPT, just like teachers told me not to use Wikipedia. \n<br><br>\nI didn't listen. I used Wikipedia anyway. I still use Wikipedia. Every day. \n<br><br>\nAsking me not to was unrealistic, just like it's unrealistic to expect students not to take advantage of ChatGPT and the flood of services that are about to be unleashed by Google, Microsoft and Meta. Even if such a rule could be enforced, it would be counterproductive. If AI is going to be part of life, it's better for students to figure out how to best work with it rather than against it. We've all got a bit of Luddite spirit within us, but the actual Luddites' fight was futile. \n<br><br>\nAfter years of artificial intelligence hype, ChatGPT solidified the idea that AI probably will disrupt many industries. But disruption can mean change rather than destruction. In many cases, that change will be for the better. Education is a prime candidate for improvement. The industry is notoriously slow moving, and can be prodded by AI without the risk of mass layoffs since teachers' jobs are typically more secure than many others. \n<br><br>\nThe question is whether high schools, colleges and universities will adapt to the challenge. Elon Musk tweeted that AI may usher in the end of homework. Maybe. What if education adapts? Essays can be replaced by presentations or practical tasks relevant to the area of study. In essay assignments that remain, students can be marked more on how persuasive they are rather than a basic ability to relay course concepts.\n<br><br>\nIf university courses, for example, can't be made more practical, maybe that's a sign they were never teaching anything practical in the first place. \n<br><br>\nIf I could time travel and use ChatGPT in my university course, it would only help me cheat on the assignments that were the least educational in the first place. It wouldn't have made a difference to the journalism assignments that were actually useful -- the ones that taught me to be prepared for interviews, to always use the rule of three and to end commentary articles with a nod to the opening paragraph."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed754"
  },
  "article": "Steam Deck Is on Sale for the First Time Ever, Get 10% Off Right Now",
  "important": false,
  "author": "Oscar Gonzalez",
  "publishing_time": "2023-03-17T14:15:00Z",
  "image": "https://www.cnet.com/a/img/resize/0d656be09f160c381e2cc6298c0014a6b9cd2f5f/hub/2023/02/27/c46adf3d-29ea-42f9-922a-b3ca8fe44999/steam-deck-feb-2023.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The portable PC gaming device turned a year old in February.\n<br><br>\nValve's portable gaming device, the Steam Deck, came out just over a year ago. The company is celebrating the occasion with a big sale.   \n<br><br>\nFor the first time since its launch, the Steam Deck went on sale, getting a 10% discount on Thursday. This drops the price to $359 for the the 64GB version, $476 for the 256GB and $584 for the 512GB. The sale on the portable console will last until the end of the Steam Spring Sale on March 23. \n<br><br>\nHere's how the pricing lands for each model during this sale:\n64GB eMMC model: $359 (save $40) \n256GB NVMe SSD model: $476 (save $53)  \n512GB NVMe SSD model: $584 (save $65). \nAnd you can also expand storage with a microSD card (sold separately). \n<br><br>\nAlong with the discount, Valve added a new feature to the Steam Deck on Thursday. The latest update will let users create their own or use already-made startup movies for when the system boots up. \n<br><br>\nValve first revealed its Steam Deck in July 2021. It set the stage for truly portable PC gaming, similar to what the Nintendo Switch did for console gaming. High demand for the Steam Deck, on top of a two-month delay, led to preorders being spaced out throughout 2022, with the first units shipped to customers on Feb. 28. \nSince its initial release, Valve has said there will be a next generation of Steam Deck, though no timeline has been confirmed. Steam Deck owners discovered a wealth of uses for the device, from emulating old consoles to playing Xbox games via the cloud."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed756"
  },
  "article": "Best 3D Printer for 2023: Prusa, Bambu Lab, Anycubic and More",
  "important": false,
  "author": [
    "Dan Ackerman",
    "James Bricknell"
  ],
  "publishing_time": "2023-03-17T12:00:00Z",
  "image": "https://www.cnet.com/a/img/resize/33d8f39100d170cde655fd9d5b8089be790a2fe3/hub/2022/11/18/3b0d9d1d-a59c-4bec-aed6-3c27f18412f3/bambu-p1p-pegboard.jpg?auto=webp&fit=crop&height=362&width=644",
  "text": "These are our favorite 3D printers, scanners and laser cutters for makers and creators.\n<br><br>\nIn the last few years, 3D printing has become much more commonplace and accessible for hopeful hobbyists. If you like miniatures, figurines or cosplay, 3D printing is an excellent vocation to take on. And there are a ton of great 3D printers, packed with the premium features, that you can get set up and printing with relative ease.\n<br><br>\nCurrent 3D printers, which range from affordable (under $300) to high-end (over $4,000), are great gifts for a creative person in your life. Even better, they're great for you to print objects and craft your own personalized designs if you're looking to open an Etsy shop or something similar. If you're looking for some of the best 3D printer options on the market right now, I've done an in-depth analysis on 3D printers in all different price ranges from more affordable printer models to the highest cost varieties, to bring you a comprehensive scope on what makes a reliable printer and sound investment.\n<br><br>\nWe've taken a deep dive into many of the best 3D printers available today. This list includes both small and large 3D printers, with attention paid to print speed, the size of the build plate, the cost of PLA filament, the kind of print head included and other important details. And once you've decided to take the plunge into additive manufacturing -- that's what 3D printing essentially is -- there's an FAQ below.\n<br><br>\nWhat to consider before buying a 3D printer\nPurchasing your first 3D printer can be nerve-wracking but don't worry; we are here to help. There are a few main areas that you should consider when choosing the best 3D printer, and we have them covered here.\n<br><br>\nWhat am I 3D printing?\nWhen deciding on what 3D printer to buy, you first have to know what type of things you want it to print. Resin 3D printing is good for highly detailed models such as character busts, dental work or tabletop miniatures. Even jewelry can be made using a resin 3D printer. \n<br><br>\nFor almost every other application, an FDM, aka filament, 3D printer, is likely the best choice. Filament 3D printing is versatile in the types of material you can use and offers much larger build volumes to work on models. Cosplay armor and helmets, practical parts and large-scale models are best printed on an FDM printer. \n<br><br>\nWhat is build volume?\nBuild volume is the amount of space a printer has to produce a model. Often calculated in millimeters cubed, it is the combination of the width, height and depth that your printer's nozzle can reach. This is not always the same as the internal volume of a 3D printer because the wiring and other mechanical parts can get in the way of the nozzle, reducing the area available. \n<br><br>\nMost FDM printers have a build area of around 220 by 220 by 250mm, though some of the best 3D printers have larger and a few of the best budget 3D printers have smaller. I think the 220 by 220mm build plate is a good size for starting out as it has room for large, practical pieces or several smaller models at once. \n<br><br>\nShould I wait for a deal to buy a 3D printer?\n3D printers are often available throughout the year at a discount price. Special days like Prime Day, Black Friday and Cyber Monday are great occasions to pick yourself up a new machine, but there are still plenty of deals to be had on a normal day. Make sure you stay fluid and choose your 3D printer deal based on the availability of the machine and what your research has told you is the best.\n<br><br>\nBest 3D printers\nBambu Lab P1P\nOutrageous speed and quality\nThe P1P from Bambu Lab is the type of printer I wish I had owned when I first started out. The quality is excellent, up there in the top three of all the printers on this list, and the speed is staggering. It's so fast you can print three times faster than almost every other printer on this list.\n<br><br>\nFor $700, the P1P is an absolute no-brainer. It is easy to set up, and while the Wi-Fi sucks, it's still an amazing piece of engineering.\n<br><br>\n$699 at Bambu Lab Store\n<br><br>\nPrusa Mk3S Plus\nThe standard candle for home 3D printing\nNo best 3D printer list is really complete without the Prusa MK3S Plus. For nearly a decade it has dominated the market and continues to be the go-to printer for anyone looking to make a business from 3D printing. It is fast and creates quality prints every time. I can count the number of print fails from MK3 on one hand, and I have had it for nearly seven years. If you have the $800, you should buy one of these. \n<br><br>\n$799 at Prusa Research\n<br><br>\nCreality Ender-3 S1\nBest 3D printer for beginners\nI'd avoided Ender-3 printers for a long while, because they came in kit form and required many hours of assembly, setup and fine-tuning to use. For just a little more than the kit versions, the newer Ender-3 S1 comes nearly fully preassembled, and with high-end features like a direct drive extruder and self-leveling bed. \n<br><br>\nPrint quality even out-of-the-box was excellent, although a lot of that comes down to having good models to work from. I'd love it to have a touchscreen and Wi-Fi, but apart from those missing features, this is a great way to get polished results from a $400 3D printer. \n<br><br>\n$349 at Amazon\n$350 at Creality3d\n<br><br>\nAnkerMake M5\nSpeed and quality combined\nThe AnkerMake M5 is a new breed of 3D printer. Its speed is unrivaled on this list and the quality of the end product is on par with anything I've seen. When you can get this quality level in a 3D print job in around half the time of its closest competitor, it's hard to recommend anything else for someone with the money to buy one.\n<br><br>\nAnycubic Vyper\nBest for out-of-the-box printing\nThe Anycubic Vyper FDM printer attempts to be both an affordable 3D printer and easy to use. It's a tricky needle to thread. Plenty of 3D printers offer automatic bed leveling and calibration to make sure prints come out even and firmly anchored to the print bed. This, however, is the first time I've seen a 3D printer run its bed leveling once, with zero manual input from me, and be totally good to go. I printed a 3D test file from the included SD card within minutes of powering on, and I've never seen a first print from a 3D printer come out so perfectly.\n<br><br>\n$319 at Anycubic\n<br><br>\nAnycubic\nAnycubic Kobra Max\nBest to make big projects easily\nThe Anycubic Kobra Max earned a 9 out of 10 in our recent review, in large part because it's one of the most enjoyable printers I've used in years. The build area is large enough to print entire helmets for cosplay, and the auto-bed-leveling system makes setting the machine up a breeze. The Kobra Max is the best choice for a large build area printer, bar none."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed752"
  },
  "article": "Got a New iPhone? Here's How to Take Your Best Photos Ever",
  "important": true,
  "author": "Andrew Lanxon",
  "publishing_time": "2023-03-17T05:00:00Z",
  "image": "https://www.cnet.com/a/img/resize/d99f708b1e6c7db1ffda00fc1f5d8e35ca7da558/hub/2022/10/05/c29087ff-e885-4668-8cde-8de5a609f716/apple-iphone-14-pro-cnet-promo-11.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "Whether you have an iPhone 14 Pro or an earlier phone, these pro tips will help you get your best ever photos.\n<br><br>\nWe gave Apple's iPhone 14 Pro a CNET Editors' Choice award for a variety of reasons, but one of the biggest was its awesome triple camera system. It can take beautiful photos that comfortably rival shots from the best camera phones out there, including Samsung's Galaxy S23 Ultra and Google's recent Pixel 7 Pro. It takes great photos at night, too. \n<br><br>\nThe iPhone's powerful combination of gorgeous image quality, software processing and advanced features, such as Apple's own ProRaw image format, means the iPhone's images can look like they were taken on a professional-level camera. \n<br><br>\nThen there's the wide array of amazing photo editing apps available on iOS that can help turn even a regular image into an eye-catching piece of digital art. \n<br><br>\nBut simply having a great camera isn't the only thing you need to take award-worthy images. Knowing the tricks of the trade will make the difference between coming home with some fun snaps and coming back with beautiful photos you can't wait to print and frame for your wall.\n<br><br>\nHere, then, are my top tips for better images, techniques that I use every day as a professional photographer, from working with the light to using more-creative angles to polishing up your shots in editing apps. Many of these tips will apply on any recent phone you may have, including the base iPhone 14 or older models like the iPhone 13 and iPhone SE and even many Android phones. Looking for a new phone for taking photos? Check out our guide to the best camera phones. \n<br><br>\nKnow when to use the different lenses.\nIt's easy to stand in front of a picturesque scene and flick between the normal, super wide and zoomed views on the phone, but it's more difficult to understand exactly why one might be better than the other for a particular composition. To figure it out, you need to take an extra moment to look at what's important in the scene in front of you. \n<br><br>\nIs there a particular subject -- perhaps a statue or an impressive building -- that's surrounded by lots of other elements like trees, sign posts or street lights? Using the iPhone 14 Pro's 3x telephoto zoom here is a great way of isolating your subject and eliminating all those distractions. You may need to move back a bit and then zoom in to keep it in frame, but simplifying your scene like this will help your subject stand out. \n<br><br>\nBut perhaps it's those extra surrounding elements that really add to the scene and provide context for where you are. In that case, using the standard zoom will allow you to keep those items in the shot. Switching to the super wide view will capture even more of the surroundings. So to avoid your subject getting lost in the frame, you might want to move closer and find interesting foreground objects (a patch of flowers, a cool-looking rock) to add to the composition.\n<br><br>\nRevisit at different times of day.\nThe awesome low-light skills of the iPhone 14 Pro mean you're not limited to only taking photos at midday when the sun is at its highest. Sunrises and sunsets will typically be darker, but may reward you with beautiful colors in the sky and great contrast in the light being cast. Landscape photographers know that getting up before dawn can often yield the best results and it's something that's always worth keeping in mind, if you can stomach the early rises. \n<br><br>\nIf you're willing to try a sunrise shoot at least once, visit the spots you've already shot and see how they're transformed by the different light. It's this that will separate your images from the hundreds of others on Instagram who just took a snap after their morning coffee.\n<br><br>\nDon't be afraid of the dark.\nDon't think that once the light goes altogether you need to stop shooting. The iPhone 14 Pro has one of the best night modes on any phone and can take astonishing night-time photos. City scenes, with car headlights, vibrant shop window displays and even festive holiday decorations can provide superb fodder for night shots. And don't worry if it rains. Those wet streets will now reflect all of those lights, which can look amazing.\n<br><br>\nShoot in ProRaw, edit your shots later.\nA few careful tweaks in editing apps like Adobe Lightroom can make all the difference between an everyday snap and a beautiful piece of art. Thankfully, Apple has made this even better with the introduction of ProRaw. \n<br><br>\nProRaw is much the same as shooting in raw on regular DSLRs; it doesn't save all the image data, allowing you to change white balance and alter colors much more accurately after you've taken your shot. \n<br><br>\nIt also captures more detail in the shadows and highlights of your images, giving more scope for rescuing those bright skies with the highlights slider or bringing back a bit more visible detail in the darker shadows. You'll see the raw button in the top corner of your screen when you're in the camera, so make sure it doesn't have a line through it if you're taking an image that you know you'll want to polish up later to look its best. You can edit JPEG images too. I's just that you won't have quite the same level of flexibility. \n<br><br>\nI use Adobe Lightroom Mobile for most of my phone editing. It's a professional tool and has a lot of granular control over color and exposure, while also syncing my images to the cloud so I can pick up my edits later on my iPad or my desktop computer. If you don't fancy the monthly fees, Google's Snapseed is free and also has a lot of superb features for getting the best from your shots, including a variety of film effects that give some beautiful color toning to your photos.\n<br><br>\nIf you want to get a bit more wild and creative, you should check out apps like Bazaart and PicsArt, which provide a variety of tools and effects for compositing images to turn them from photos into often bizarre pieces of modern art. Take a look at my roundup of image editing apps for more ideas.\nRemember that there is no right or wrong way to edit your images, and applying creative effects doesn't mean deleting the original file -- so you can always go back and try again if you don't like the result. My advice is to get a cup of tea, sit back in a comfy chair and spend some time playing with your editing app of choice and seeing what you can create. You may be surprised at what you can come up with, even from images you took some time ago."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed758"
  },
  "article": "Best Smart TV for 2023: Top Picks With Roku, Google and More for Every Budget",
  "important": false,
  "author": [
    "David Katzmaier",
    "Sarah Lord"
  ],
  "publishing_time": "2023-03-08T07:30:00Z",
  "image": "https://www.cnet.com/a/img/resize/794c763a2e4fb22fc7765ee11e4731c8a1b2aedc/hub/2022/10/18/b643bc41-614e-4a5e-acaa-649281580f68/tcl-6-series-tv-r6-2022-6396.jpg?auto=webp&fit=crop&height=362&width=644",
  "text": "Our experts have tested the best smart TVs for streaming, picture quality, sound and more.\n<br><br>\nIf you're shopping for a new TV, the odds are you'll be looking at a smart TV. Nearly every new TV these days has smart features of some sort, allowing you to stream services like Netflix and Disney Plus without using a dedicated streaming device. With so many different brands on the market, it can be difficult to tell what separates a good smart TV from the best smart TVs out there, but we're here to help.\n<br><br>\nOur TV reviews take smart TV systems into account, but we think that picture quality for the money is usually more important when purchasing a new TV. That's because you can always 'replace' the TV's built-in system with a good streaming device, most of which cost less than $50. The exception is for budget TVs, where the price of the streaming device could make up a significant percentage of the cost -- for this list, unlike our main best TVs list -- we weighted the importance of the smart TV system higher for budget models we had reviewed. \n<br><br>\nOur list below is generally arranged in order of which TVs provide the best picture for the money, but we also note how much we like (or dislike) the built-in smart TV system. \n<br><br>\nBest smart TVs to buy\nTCL 6-Series Roku TV\nBest smart TV for the money\n<br><br>\nFor the last five years the TCL 6-Series has been our favorite TV for the money, and the 2022 version -- also known as the R655 series -- is no exception. This TV has an excellent image thanks to mini-LED tech and well-implemented full-array local dimming that helps it run circles around just about any other TV at this price. It improves upon the previous R635 series with more gaming extras and a new center-mount stand that you can elevate to make room for a soundbar, although the new 85-inch size has standard legs. And finally, the Roku TV operating system is our hands-down favorite.\n<br><br>\nNote that in addition to the R635, which this TV replaces, other versions of the 6-Series were released in 2021 and remain on sale. The R646 series uses the Google TV operating system but otherwise has similar specifications to the R655 models reviewed here. The R648 series has 8K resolution and is significantly more expensive. \n<br><br>\nTCL 4-Series\nBest budget smart TV system\n<br><br>\nThe picture quality of the TCL 4-Series Roku TV was only a slight step behind the Vizio V-Series (below) in our 2023 budget TV test, but we liked its Roku smart TV system better than Vizio's SmartCast, so the TCL gets the top spot on this list. The 4-Series lacks the Dolby Vision, Bluetooth connectivity and AMD FreeSync with a variable refresh rate, all of which the Vizio offers, but in our book superior smart TV streaming is more important at the budget level.\n<br><br>\nLG OLED C2\nBest high-end smart TV for the money\nThe C2 represents the pinnacle of picture quality at a price that's admittedly high, but not too crazy. It beats any non-OLED TV on this list, including the Samsung QN90B below, with its perfect black levels, unbeatable contrast and superb off-angle viewing. It also has superb gaming features, making it the perfect companion to an Xbox Series X or S, PlayStation 5 or both. The C2 comes in a wide variety of sizes as well, although the bigger models are really expensive.\n<br><br>\nLike its predecessor the C1, the C2 is bogged down by the WebOS smart TV system. Signing in to an LG account unlocks another feature, customized recommendations and additional user accounts. LG touts the fact that you can set up favorite sports teams, for example, but most people will just go straight to the app and skip the clutter. On a TV this expensive, you should just attach a good streaming device instead. Read our LG C2 series OLED TV review.\n<br><br>\nHisense U8H Google TV\nBest smart TV for the money runner-up\nAmong midpriced models we liked the TCL 6-Series just a little better in our side-by-side comparison, but this Hisense is a strong contender. Its excellent image quality is anchored by best-in-class brightness that improves its bright-room picture quality and makes HDR TV movies, shows and games really pop. It's actually brighter than the TCL with better contrast, but the TCL's slightly more accurate image gave it the edge overall. The Hisense uses Google TV instead of Roku, and unlike the TCL, the U8H includes an ATSC 3.0 tuner. Frankly, you can't go wrong with either one.\n<br><br>\nSamsung QN90B\nBest high-end smart TV that's not an OLED\nLooking for a high-end TV with spectacular image quality, but don't want an OLED? The Samsung QN90B is your best bet. This TV uses QLED TV tech augmented by mini-LED for a brighter image than any OLED TV. The spectacular contrast of OLED still won out in our side-by-side tests, but the QN90B QLED screen comes closer than ever. \n<br><br>\nThe older version of this TV, the QN90A, remains on sale for hundreds less. It's also an excellent performer but it's slightly dimmer than the QN90B. It also lacks some of the 2022 model's features, including the new game hub with cloud gaming. \n<br><br>\nSamsung's onscreen smart TV system is excellent, with quick responses and plenty of apps -- we'd take it over LG or Vizio's systems. We still like Roku and Android/Google TV (found on Sony TVs) better overall, however, because they have even more apps. Just like most TVs now (including Roku), Samsung has the Apple TV app and works with Apple's AirPlay system.\n<br><br>\nVizio V-Series\nBest budget smart TV picture quality\nWhen we compared the best 2022 budget TVs, the picture quality of Vizio V-Series clearly emerged as the leader of the pack. The Vizio offered the most balanced and accurate picture during our comparisons, and it comes with some useful extras such as Dolby Vision support, Wi-Fi 6E, Bluetooth compatibility and variable refresh rate for potentially smoother gaming. \n<br><br>\nThe biggest downside of the Vizio is its smart TV platform, Vizio SmartCast. It's crowded, slow and littered with ads for platforms such as Tubi and Kidoodle TV. That's why the TCL 4-Series with Roku gets the top slot. That said, if you value its image quality and extra features, you can always add a separate streaming device to this Vizio.\n<br><br>\nSamsung Q60B\nBest design in a midprice smart TV\n<br><br>\nSamsung is the brand that sells more TVs than anyone, and one of its most popular is the Q60 series. Its sleek QLED screen design stands out compared with the other TVs on this list -- even though the ultrathin OLED models are sleeker -- and it offers better features, image quality and more sizes than models like the TCL 4-Series and Sony X80K. The TVs listed in this article are all superior values, but if you want a Samsung TV and can't afford the QN90A, this is a great choice.\n<br><br>\nNote that the 2021 version, the Q60A, is still on sale and can be cheaper than the Q60B in some sizes. The newer version measured brighter in our tests, but if you want the best deal, stick with the Q60A if it's still available.\n<br><br>\nVizio MQX\nBest alternative smart TV for tighter budgets\n<br><br>\nThe Vizio MQX is one of the least expensive TVs to feature full-array local dimming, which lets it reproduce shows, movies and games with enough contrast and pop to do HDR justice. The MQX has fewer dimming zones than more expensive TVs like the TCL 6-Series, but they're more than enough to create excellent overall picture quality, with bright highlights, dark black levels, punchy contrast and accurate color.\n<br><br>\nUnlike the M7 last year, the MQX has a true 120Hz refresh rate, which allows compatibility with 4K/120Hz signals from game consoles like Xbox Series X and PlayStation 5 and worked well in our tests. Vizio supports both major HDR formats, HDR10 and Dolby Vision, in the M-Series. \n<br><br>\nVizio's SmartCast smart TV menus haven't changed much aside from adding a new 'Inputs' button, a welcome addition... albeit one Roku TVs have offered for years. Although all the major streaming services are accounted for, the interface is worse than Roku and Google TV. The main issue with Vizio is cluttering the screen with a bunch of TV shows and movies we don't care about.\n<br><br>\nRoku's grid of apps is simple and familiar, and if you want your homepage to show more relevant programming, Google TV does a much better job. But If you can't save up for the TCL 6-Series and want a better picture than the 4-Series, the Vizio MQX is an excellent happy medium. Just make sure to get a Roku. Read our Vizio MQX review."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed755"
  },
  "article": "Diablo 4 Takes Bleakness to a New Level, Which Is Just Fine With Me",
  "important": true,
  "author": "Oscar Gonzalez",
  "publishing_time": "2023-03-18T14:31:00Z",
  "image": "https://www.cnet.com/a/img/resize/9b39ca1092c622f4369a26e8236896cb2eeded70/hub/2022/12/07/479999ae-f010-4737-af4a-1f1a3ad47185/igcshowcase-lilith-02.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The Diablo franchise has had some incredible highs and more than a few lows. \n<br><br>\nGames like Diablo II: Resurrected received huge hype when first announced but failed to win over fans when it came out. Diablo Immortal received ridicule from day one that didn't stop after its release. Diablo 4, however, is another entry into the series with a lot of buzz, and the developer team has a grasp of the pressure on it as well as the legacy it has to live up to when it comes out on June 6. \n<br><br>\nHaving spent eight to 10 hours playing Diablo 4 on the Xbox Series X back in December, I can confirm the short amount of time I spent with the game was downright disturbing -- in a good way. Fans of the game can check out the game for themselves starting Friday with the Diablo 4 beta. \n<br><br>\nThe game's 'Return to Darkness' tagline is more than a marketing ploy. It heralds a return to the bleak, dark world of Diablo that's been ensnaring gamers since the original's debut back in 1997. In those days having a game with a boss named Diablo was disturbing enough. In current times, the envelope has to be pushed a bit more. \n<br><br>\n<i>'When you look at what pop culture is like in the industry, you have Game of Thrones, Walking Dead and Sons of Anarchy,'</i> said Rod Fergusson, general manager for Diablo. <i>'These are very dark topics and dark themes that are mainstream. We felt like this was an opportunity to kind of embrace Diablo's roots and bring it to the forefront and make it mainstream as well.'</i>\n<br><br>\nLeading this darker tone is the main antagonist, Lilith. She's the daughter of Mephisto, one of the Great Evils, and is called the Mother of Sanctuary, the world in which the Diablo series takes place. Unlike previous games where there was a slow buildup to the big boss behind all the evil in the world, Blizzard put Lilith upfront from the very first cutscene. \n<br><br>\nWhen it launches later in June, Diablo 4 will have five classes available to play: Barbarian, Rogue, Sorceress, Necromancer and Druid. Since the Necromancer wasn't available, I went with the Barbarian to get a feel of the melee combat and how dynamic it is. It's also one of the classes I've played the most in the series.  \n<br><br>\nThe playable build starts off at Fractured Peaks with my hero's horse being killed leaving him in a cave by himself for the night. From the caves came the first stop, Nevesk, a very small town where things aren't what they seem. Lilith already had an impact on the few people here, and her true power comes from having people indulge their dark side. This was the first interaction my character had with other NPCs, and it was pretty clear how the developers wanted to give the hero more of a part within the story by having their own dialogue and playing a part in the cutscenes. \n<br><br>\nIt's in the town of Nevesk where Lilith's effect on the people of Sanctuary is shown. There's far more to her than just being evil, which sets her as an interesting antagonist when compared with the other Great Evils from previous Diablo titles. While her ultimate plan isn't apparent early on, Lilith's presence is immediately felt and was done deliberately so by the development team. \n<br><br>\n<i>'By having you unravel her story about what's happening, her impact on the world, you get to hear her motivations,'</i> said game director Joe Shely. <i>'You get to understand what she's trying to do and you get to get more connected to her and maybe there's even a little bit of ambiguity there where you're like: watch Star Wars and go like maybe Vader was right. I think that notion of having more face time with the big bad means that it's a much more satisfying resolve as you play through the story, as you go through it.'</i>\n<br><br>\nDiablo 4 doesn't stray from the hack-and-slash action the series is known for, but movement feels more fluid and active thanks to the evade move. First introduced in Diablo 3, the evade button feels more integrated into the sequel. Certain enemies telegraph attacks, allowing the player to dart away in response. The developers say as the players level up, other options to evade, such as being able to pull off multiple dodges at a time, can be unlocked. \n<br><br>\nThe skill tree in Diablo 4 has also evolved. As someone who played all the Diablo games, that took a bit of getting used to. The options available grant players freedom to customize for specific playstyles, but won't leave newbies feeling confused. As a Barbarian, I could focus on dual-wielding weapons for quicker attacks that deal more bleed damage or go with a two-handed slashing weapon in order to perform a spinning attack that lets me carve through huge groups of enemies. The tree looked like a buffet of attacks, but there was a logic to it all as it was in previous Diablo games.\n<br><br>\nAs expected in a Diablo game, there are plenty of dungeons to clear in Diablo 4. but the game's new open world adds a layer of complexity to the proceedings. I was surprised when I came across a cliff and there was an option to 'climb down' leading to another part of the map. \n<br><br>\nWhile there isn't an extensive, vast open world like Elden Ring or The Legend of Zelda: Breath of the Wild, it was interesting to have a broader land to explore. Previous Diablo games had procedurally generated maps that were big, yet limited. While Fractured Peak was still restricted, it didn't feel like I was bound to a map. There are horses available to purchase but only after you complete a quest that is available later on. \n<br><br>\nIn the time I played the build, I found myself compelled by Diablo 4's story as well as how it played, which isn't what I felt in Diablo 3 where it was the gameplay that kept me coming back but the storyline was quickly forgotten. Combine that with an open world and I was even more enticed to explore while also seeing how I can build my Barbarian. It's that combination of story and gameplay that makes what I played of Diablo 4 so interesting and should be the same for fans when it comes out. \n<br><br>\nDiablo 4 will release on the PC, PS4, PS5, Xbox One and Xbox Series X|S for $70 in June."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed759"
  },
  "article": "AI Gets Smarter, Safer, More Visual With GPT-4 Update, OpenAI Says",
  "important": true,
  "author": "Stephen Shankland",
  "publishing_time": "2023-03-15T11:28:00Z",
  "image": "https://www.cnet.com/a/img/resize/589fa8ea70e908ebee10634bd492bb3300c57a7e/hub/2023/02/08/ab062053-b8ba-4938-9711-5f0cc97f4f0e/20230207-openai-ceo-sam-altman-01.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "If you subscribe to ChatGPT Plus, you can try it out now.\n<br><br>\nThe hottest AI technology foundation got a big upgrade Tuesday with OpenAI's GPT-4 release now available in the premium version of the ChatGPT chatbot.\n<br><br>\nGPT-4 can generate much longer strings of text and respond when people feed it images, and it's designed to do a better job avoiding artificial intelligence pitfalls visible in the earlier GPT-3.5, OpenAI said Tuesday. For example, when taking bar exams that attorneys must pass to practice law, GPT-4 ranks in the top 10% of scores compared with the bottom 10% for GPT-3.5, the AI research company said.\n<br><br>\nGPT stands for Generative Pretrained Transformer, a reference to the fact that it can generate text on its own — now up to 25,000 words with GPT-4 — and that it uses an AI technology called transformers that Google pioneered. It's a type of AI called a large language model, or LLM, that's trained on vast swaths of data harvested from the internet, learning mathematically to spot patterns and reproduce styles. Human overseers rate results to steer GPT in the right direction, and GPT-4 has more of this feedback.\n<br><br>\nOpenAI has made GPT available to developers for years, but ChatGPT, which debuted in November, offered an easy interface ordinary folks can use. That yielded an explosion of interest, experimentation and worry about the downsides of the technology. It can do everything from generating programming code and answering exam questions to writing poetry and supplying basic facts. It's remarkable if not always reliable.\n<br><br>\nChatGPT is free, but it can falter when demand is high. In January, OpenAI began offering ChatGPT Plus for $20 per month with assured availability and, now, the GPT-4 foundation. Developers can sign up on a waiting list to get their own access to GPT-4.\n<br><br>\nGPT-4 advancements\n'In a casual conversation, the distinction between GPT-3.5 and GPT-4 can be subtle. The difference comes out when the complexity of the task reaches a sufficient threshold,' OpenAI said. 'GPT-4 is more reliable, creative and able to handle much more nuanced instructions than GPT-3.5.'\n<br><br>\nAnother major advance in GPT-4 is the ability to accept input data that includes text and photos. OpenAI's example is asking the chatbot to explain a joke showing a bulky decades-old computer cable plugged into a modern iPhone's tiny Lightning port. This feature also helps GPT take tests that aren't just textual, but it isn't yet available in ChatGPT Plus.\n<br><br>\nAnother is better performance avoiding AI problems like hallucinations -- incorrectly fabricated responses, often offered with just as much seeming authority as answers the AI gets right. GPT-4 also is better at thwarting attempts to get it to say the wrong thing: 'GPT-4 scores 40% higher than our latest GPT-3.5 on our internal adversarial factuality evaluations,' OpenAI said.\n<br><br>\nGPT-4 also adds new 'steerability' options. Users of large language models today often must engage in elaborate 'prompt engineering,' learning how to embed specific cues in their prompts to get the right sort of responses. GPT-4 adds a system command option that lets users set a specific tone or style, for example programming code or a Socratic tutor: 'You are a tutor that always responds in the Socratic style. You never give the student the answer, but always try to ask just the right question to help them learn to think for themselves.'\n<br><br>\n'Stochastic parrots' and other problems\nOpenAI acknowledges significant shortcomings that persist with GPT-4, though it also touts progress avoiding them.\n<br><br>\n<i>'It can sometimes make simple reasoning errors ... or be overly gullible in accepting obvious false statements from a user. And sometimes it can fail at hard problems the same way humans do, such as introducing security vulnerabilities into code it produces,'</i> OpenAI said. In addition, <i>'GPT-4 can also be confidently wrong in its predictions, not taking care to double-check work when it's likely to make a mistake.'</i>\n<br><br>\nLarge language models can deliver impressive results, seeming to understand huge amounts of subject matter and to converse in human-sounding if somewhat stilted language. Fundamentally, though, LLM AIs don't really know anything. They're just able to string words together in statistically very refined ways.\n<br><br>\nThis statistical but fundamentally somewhat hollow approach to knowledge led researchers, including former Google AI researchers Emily Bender and Timnit Gebru, to warn of the 'dangers of stochastic parrots' that come with large language models. Language model AIs tend to encode biases, stereotypes and negative sentiment present in training data, and researchers and other people using these models tend 'to mistake ... performance gains for actual natural language understanding.'\n<br><br>\nOpenAI Chief Executive Sam Altman acknowledges problems, but he's pleased overall with the progress shown with GPT-4. 'It is more creative than previous models, it hallucinates significantly less, and it is less biased. It can pass a bar exam and score a 5 on several AP exams,' Altman tweeted Tuesday.\n<br><br>\nOne worry about AI is that students will use it to cheat, for example when answering essay questions. It's a real risk, though some educators actively embrace LLMs as a tool, like search engines and Wikipedia. Plagiarism detection companies are adapting to AI by training their own detection models. One such company, Crossplag, said Wednesday that after testing about 50 documents that GPT-4 generated, 'our accuracy rate was above 98.5%.'\n<br><br>\nOpenAI, Microsoft and Nvidia partnership\nOpenAI got a big boost when Microsoft said in February it's using GPT technology in its Bing search engine, including a chat features similar to ChatGPT. On Tuesday, Microsoft said it's using GPT-4 for the Bing work. Together, OpenAI and Microsoft pose a major search threat to Google, but Google has its own large language model technology too, including a chatbot called Bard that Google is testing privately.\n<br><br>\nAlso on Tuesday, Google announced it'll begin limited testing of its own AI technology to boost writing Gmail emails and Google Docs word processing documents. 'With your collaborative AI partner you can continue to refine and edit, getting more suggestions as needed,' Google said.\n<br><br>\nThat phrasing mirrors Microsoft's 'co-pilot' positioning of AI technology. Calling it an aid to human-led work is a common stance, given the problems of the technology and the necessity for careful human oversight. \n<br><br>\nMicrosoft uses GPT technology both to evaluate the searches people type into Bing and, in some cases, to offer more elaborate, conversational responses. The results can be much more informative than those of earlier search engines, but the more conversational interface that can be invoked as an option has had problems that make it look unhinged.\n<br><br>\nTo train GPT, OpenAI used Microsoft's Azure cloud computing service, including thousands of Nvidia's A100 graphics processing units, or GPUs, yoked together. Azure now can use Nvidia's new H100 processors, which include specific circuitry to accelerate AI transformer calculations.\n<br><br>\nAI chatbots everywhere\nAnother large language model developer, Anthropic, also unveiled an AI chatbot called Claude on Tuesday. The company, which counts Google as an investor, opened a waiting list for Claude.\n<br><br>\n<i>'Claude is capable of a wide variety of conversational and text processing tasks while maintaining a high degree of reliability and predictability,'</i> Anthropic said in a blog post. <i>'Claude can help with use cases including summarization, search, creative and collaborative writing, Q&A, coding and more.'</i>\n<br><br>\nIt's one of a growing crowd. Chinese search and tech giant Baidu is working on a chatbot called Ernie Bot. Meta, parent of Facebook and Instagram, consolidated its AI operations into a bigger team and plans to build more generative AI into its products. Even Snapchat is getting in on the game with a GPT-based chatbot called My AI.\n<br><br>\nExpect more refinements in the future.\n<br><br>\n<i>'We have had the initial training of GPT-4 done for quite awhile, but it's taken us a long time and a lot of work to feel ready to release it,' Altman tweeted. 'We hope you enjoy it and we really appreciate feedback on its shortcomings.'</i>"
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed75a"
  },
  "article": "Samsung Launches the Galaxy A54 5G to Challenge the Pixel 6A",
  "important": false,
  "author": "Lisa Eadicicco",
  "publishing_time": "2023-03-16T07:06:00Z",
  "image": "https://www.cnet.com/a/img/resize/b5a46950c7f33fe66ee43502f514e756ad4d8288/hub/2023/03/14/89b1fca4-cb60-456b-850c-3eb6b0a850c8/galaxy-a54-5g.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "Samsung's new sub-$500 phone arrives just before we're expecting to hear about the Pixel 7A.\n<br><br>\nSamsung's giving Google more competition in the market for affordable phones with the newly announced $450 Galaxy A54 5G. The phone launches on April 6 and will be available for preorder starting March 30, representing Samsung's latest effort to capture the market for middle-tier smartphones. \n<br><br>\nThe Galaxy A54 5G has a lot in common with last year's Galaxy A53 5G. That phone punched above its weight in many ways, except for its occasionally laggy performance, as I wrote in my review. Both phones have a 5,000-mAh battery, which matches the Galaxy S23 Ultra's in capacity, a screen with a 120Hz adaptive refresh rate and 128GB of storage that's expandable up to 1TB. They also have very similar screen sizes, with the Galaxy A54's measuring 6.4 inches, making it just slightly smaller than the Galaxy A53's 6.5-inch display. International pricing wasn't immediately available. But the Galaxy A53 5G had the same US price at launch, and lists for £399 and AU$699 in the UK and Australia, respectively. \n<br><br>\nThe biggest changes Samsung made to its new phone have to do with the camera. The Galaxy A54 5G has a 50-megapixel primary camera instead of the Galaxy A53's 64-megapixel main sensor, although both phones have a 12-megapixel ultrawide camera and a 5-megapixel macro camera. Samsung instead seems to be emphasizing nighttime photography with the Galaxy A54 5G, although we won't know how much of an improvement to expect until we are able to try it. The company also says the pixels in the Galaxy A54 5G's sensor are larger than those in the Galaxy A53 5G's camera, therefore requiring fewer megapixels. Like its predecessor, the Galaxy A54 5G also has a 32-megapixel front camera, but Samsung got rid of the rear-facing 5-megapixel depth camera.\n<br><br>\nThe Galaxy A54 5G will run on an Exynos 1380 processor, which sounds like it might be the successor to the Exynos 1280 chip in last year's phone. I'm curious to see whether this chip makes a difference, since performance was one of my few complaints about the Galaxy A53 5G. Like other recent Samsung phones, the Galaxy A54 5G will receive four generations of Android OS updates and five years of security updates. \nSamsung's flagship Galaxy S devices and its foldable phones may attract the most attention, but the company's A-series devices have built a serious following. Two of Samsung's A-series devices, the Galaxy A13 and Galaxy A03, made it into Counterpoint Research's rankings of the top-selling phones in 2022, while the Galaxy S series was nowhere to be found. \n<br><br>\nThe launch comes as Google has been competing with Samsung more aggressively on price in recent years. Google has its own A-series devices that offer some features from its flagship Pixel line at a more affordable price. The $450 Pixel 6A, for example, is one of the best-looking phones in its price range and inherits Google's Tensor processor from the Pixel 6. It also offers a superior camera compared to the Galaxy A53 5G when taking photos in very bright or dim surroundings. Google launched the Pixel 6A last July after announcing it at its developer conference in May, so there's a chance it could launch a successor in the coming months.\nBeyond its A-series phones, Google also sells its flagship Pixel phones for significantly less than the list price of Samsung's new Galaxy S phones. The Pixel 7, for example, starts at $600, while the Galaxy S23 begins at $800 without a trade-in discount.\n<br><br>\nStill, Samsung dominates the US market for Android phones, accounting for 20% of shipments in the fourth quarter of 2022 compared to Google's 5%, according to Counterpoint Research.\n<br><br>\nThe Galaxy A54 5G is also another sign that you no longer have to pay close to $1,000 to get features like a multilens camera and a screen with a high refresh rate. It builds on a theme that's been prevalent throughout the industry in recent years, particularly on Android devices, as once-premium features like 5G, larger screens and advanced cameras have trickled down to cheaper devices. \n<br><br>\nAnd while Apple did release a third-generation of the iPhone SE last year for $429 that competes with Samsung and Google's midrange offerings, the company isn't expected to refresh its cheaper iPhone in 2023. Analyst Ming-Chi Kuo reported that a fourth iPhone SE is in development, but it's not expected to arrive until 2024."
},{
  "_id": {
    "$oid": "6414f1cfae9aca4bf30ed75b"
  },
  "article": "Zipline's New Drone Brings Aerial Delivery Closer for Millions More of Us",
  "important": false,
  "author": "Stephen Shankland",
  "publishing_time": "2023-03-14T10:37:00Z",
  "image": "https://www.cnet.com/a/img/resize/ef2c0380a8d68e24024ff4073ff63e126cbaaaf7/hub/2023/03/15/d6890114-bada-40d0-a506-60e1840c92a7/zipline-drone-dropping-droid.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The new aircraft are in testing and should go into service by early 2024.\n<br><br>\nDrone delivery company Zipline unveiled a major new aircraft on Wednesday, a model that can hover as it lowers packages on a tether. The approach is designed to reach vastly more customers than its first-generation system.\nThe South San Francisco-based company has quietly become a major player in the nascent but potentially important drone delivery market. With its first-generation aircraft, which look like small airplanes, it's completed more than 500,000 deliveries since 2016. Most of those deliveries have been in Rwanda and Ghana, but the company also has operations in Utah, Arkansas and North Carolina, too.\n<br><br>\nAnd the new drone, called Platform 2, should help expand US operations to be more practical and economical in urban and suburban areas. Zipline's Platform 1 has an efficient fixed-wing design but can't stop flying as it parachutes a package into to an area about the size of two parking spaces. Platform 2 pairs a fixed wing for forward flight with upward pointing propellers for hovering while it lowers a compact 'droid' down 330 feet to plop packages on driveways, sidewalks or other clear areas.\n<br><br>\nSeeing a package of medicine or cup of coffee drop out of the sky may seem like sci-fi, but drone delivery will reach millions of people this year as tests expand and operations mature. Drones can get items to our homes faster than delivery vans, with lower carbon dioxide emissions — just the thing for an instant gratification culture fostered by e-commerce giant Amazon.\n<br><br>\n<i>'We're adding technology to our system that prepares us to reach billions of more people around the world,'</i> Okeoma Moronu, Zipline's leader of aviation regulatory affairs, said in a statement. <i>'Our next generation platform will enable us to operate with the precision needed to fly safely into more complex environments and over more highly populated areas.'</i>\n<br><br>\nCustomers planning to use the new drones include Sweetgreen to deliver food; Michigan Medicine to fill more prescriptions from its pharmacy; Intermountain Health to deliver prescriptions in Utah's Salt Lake City area; MultiCare Health System to shuttle prescriptions and medical devices around its network of labs and medical facilities; and the Rwandan government for deliveries to homes, hotels and medical facilities in its capital, Kigali.\n<br><br>\nTethers have been used before, for example on drones from Wing, the drone delivery division from Google parent company Alphabet. But Zipline's droid has three propellers of its own to permit a smaller delivery area only about 6 feet wide, even in rain, darkness and strong winds. That opens up drone deliveries to many more houses and buildings.\n<br><br>\nAnd with a longer tether than rivals use, the drone is only about as loud as rustling leaves, Zipline said.\n<br><br>\nNoise is a crucial issue. Some Arizonans have complained about loud drones in a Walmart drone delivery project. But it's only one challenge, along with safety, privacy, cost and regulatory approvals.\n<br><br>\n'Zips' test drones on the way\nZipline is building a fleet of 100 Platform 2 aircraft, also called Zips, and droids so it can begin a 10,000-flight test program later this year. It expects the first customer deliveries by early 2024. It'll keep using its Platform 1 drones for longer-range delivery setups.\nIt's also working toward Federal Aviation Administration approval for flights that take place beyond an operator's visual line of sight — BVLOS, in aviation jargon. That's a key step for expanding beyond pilot tests.\n<br><br>\nZipline's second-generation drones can carry a payload of 6 to 8 pounds that's about the size of a grocery bag with its top rolled up. That's good for medical products — Zipline's first delivery use — as well as restaurant meals, packaged goods, groceries and other smaller items.\n<br><br>\nThe drone can fly up to 10 miles from a delivery hub, but longer flights can reach 24 miles, Zipline said. That longer reach comes into play with a planned expansion from Zipline's current hub-and-spoke operations to a network with multiple hubs and docking stations. That's the more sophisticated operational style Wing just announced, too. \n<br><br>\n<i>'Zipline's next-generation platform works as a point-to-point network consisting of many docks spread out across a variety of locations like restaurants, stores and warehouses,'</i> Zipline engineering chief Jo Mardall said. When the drones reach a dock at a business, they recharge and lower the droid for loading. \n<br><br>\n<i>'Zips are automatically routed to a dock that makes the most sense, whether that's to go recharge or to pick up another order. Zipline's software automatically ensures the network is equally distributed and that Zips go where they're needed most.'</i>"
},{
  "_id": {
    "$oid": "6417901a6ec8ef8845120f42"
  },
  "article": "VR Is Revolutionizing Therapy. Why Aren't More People Using It?",
  "important": true,
  "author": "Lisa Eadicicco",
  "publishing_time": "2023-03-26T05:00:00Z",
  "image": "https://www.cnet.com/a/img/resize/acd6866ef51bfb8c036a30638d232a204e9bf278/hub/2023/03/24/2ce60d01-e58e-4db9-8097-99f482ba5b95/vr-therapy-main.png?auto=webp&fit=crop&height=720&width=1280",
  "text": "VR therapy has been studied since the 1990s. But as of 2023, we're still talking about its potential.\n<br><br>\nSam Stokes, a New Zealand-based sales manager, isn't usually an anxious person. But there's one thing that, as he puts it, scared the shit out of him: needles. \n<br><br>\nHis aversion was severe enough to hold him back from getting routine tests. Stokes, now 40, recalls an instance in his 20s when he simply couldn't bring himself to get a blood test. He once even drove to the testing facility to get his blood drawn, but couldn't follow through with it. His partner (now wife) eventually convinced him to get the test, but he remembers it as one of \"the most horrific\" experiences he's had. \n<br><br>\n<i>\"I kind of passed out a little bit along the way, and was sweaty and clammy and all that sort of stuff,\" he said. \"I just absolutely hated the whole experience.\"</i>\n<br><br>\nWhen the COVID-19 pandemic arrived, he knew he couldn't let his needle phobia hold him back. Even watching the news became difficult, as stations regularly ran stories about vaccine developments.\n<br><br>\n<i>\"Every third story was an image of a needle, and that just freaked me out,\"</i> he said.\n<br><br>\nBut by the time Stokes became eligible to get the vaccine, he didn't feel a pinch of anxiety. No clammy hands, no cold sweats. Nothing.\n<br><br>\nStokes overcame his phobia through virtual reality, a buzzy technology that industry giants like Meta and Sony believe could be the future of gaming and online socializing. With Apple expected to announce its first headset this year, 2023 could be a landmark moment for the technology. \n<br><br>\nThe idea of using virtual reality to ease anxiety and overcome phobias isn't new; it's been studied since the 1990s. The arrival of modern VR headsets like the original Oculus Rift and HTC Vive in 2016 reignited conversations about how the technology could improve mental health care. \n<br><br>\nBut in 2023, despite the pandemic shining a spotlight on stress, anxiety and burnout, it feels like we're still talking about VR's potential as opposed to its impact. We're still far from a world in which strapping on a VR headset to conquer your fear of crowds is as common as calling your therapist before a subway commute. And it's not because of technological shortcomings. Rather, high costs, VR's slow adoption and a lack of awareness about VR therapy are to blame. \n<br><br>\n<i>\"I actually thought we'd be farther along by now,\"</i> said Dr. Barbara Rothbaum, associate vice chair of clinical research at the Emory University School of Medicine, who conducted a study published in 1995 examining how VR could be used in psychotherapy. <i>\"I thought that more people would be using it for therapeutic interventions.\"</i>\n<br><br>\nStokes, for example, only tried it because he saw a TV news segment about a study being conducted by the University of Otago in Christchurch, New Zealand, and oVRcome, maker of the same-named VR app meant for addressing phobias.\n<br><br>\n<i>\"Unlike maybe some other fears, I had an end date,\"</i> Stokes said. <i>\"I knew that I had to get a COVID vaccination. So I knew that this was my chance.\"</i>\n<br><br>\nThe evolution of VR\nIn 2023, you can attach a Google Cardboard headset to your mobile phone for less than $20 to experience VR. It certainly wasn't like that when Rothbaum and her colleagues were working on their study, which was published in the American Journal of Psychiatry in 1995. Researching whether VR would be an effective way to treat a fear of heights through exposure therapy required a $150,000 computer and a headset that cost around $16,000 back then, according to Rothbaum. \n<br><br>\nThat computer needed to be set up in a separate room not only because of its size, but also so it could be kept cool, she says. While the patient wore a head-mounted display in a small room with Rothbaum, she'd use an intercom to communicate with a graduate student operating the computer.  \n<br><br>\n<i>\"It was a very big operation,\"</i> she said.\n<br><br>\nSince finding a virtual reality headset wasn't easy in the 1990s, Rothbaum worried that she wouldn't be able to continue her research when one of her favorite models was discontinued. \n<br><br>\n<i>\"I thought, well, that's the end,\"</i> she said. <i>\"That's the end of our work.\"</i>  \n<br><br>\nLuckily, that didn't happen. The market was small, but other headsets began to crop up, often at lower prices. Rothbaum has collected so many of these headsets over the years that she has a museumlike display case in her home office filled with them. \n<br><br>\n<i>\"It was mainly the resolution,\"</i> said Rothbaum, when asked why she preferred some headsets over others. <i>\"But also, if it was not comfortable for a patient to wear for 30 minutes, then that was going to be hard to use.\"</i>\n<br><br>\nToday's VR headsets still have usability issues of their own, such as short battery life and limited compatibility with prescription glasses. But there's no denying they've come a long way from the system Rothbaum used in the '90s. Facebook parent company Meta currently dominates the virtual reality space, with 81% of the market as of the fourth quarter of 2022, according to Counterpoint Research. \n<br><br>\nIts Quest 2 headset costs $400 and doesn't require an external computing device. That alone represents a significant leap even from 2016-era headsets like the first-generation Oculus Rift and HTC Vive, both of which had to be tethered to powerful computers to fuel games and apps. Sony also just released the $550 PlayStation VR 2, which boasts a vivid display, haptics and eye tracking technology but must be tethered to a PlayStation 5. \n<br><br>\nA rise in demand for immersive at-home entertainment during the pandemic, combined with the hype surrounding the metaverse, has resulted in more attention being paid to virtual reality.\n<br><br>\n<i>\"It's still going to be probably a decade out before we have a fully realized metaverse,\"</i> said Ramon Llamas, a research director for market research firm The International Data Corporation. <i>\"But in the meantime, we're going to have a lot of fun and ... interesting innovations coming along for VR.\"</i>  \n<br><br>\nTrying VR therapy\nMany studies and research papers have been published since Rothbaum's. A scoping review from 2021 examined 19 studies that used virtual reality exposure therapy to address specific phobias. Twelve reported that VR was effective at decreasing anxiety.\n<br><br>\nIt's easy to understand why, once you try it for yourself. That's why I asked Dr. Howard Gurr, a New York-based psychologist who offers virtual reality therapy, to demonstrate the software he uses with his clients, which is provided by a company called Amelia Virtual Care.\n<br><br>\nAfter launching the app and placing my phone in the VR headset, I was transported to what would usually be a very anxiety-inducing situation for me: getting behind the wheel. I've been living in New York City for more than a decade, which means I also haven't driven a car in about 10 years. \n<br><br>\nI've always been a nervous driver, so living in the city has felt liberating, since I can rely on public transportation and Uber to get around easily. But just as Stokes had to confront his phobia to get vaccinated against COVID-19, I'll have to address mine if I want to buy a house in the suburbs with my husband and start a family. \n<br><br>\nHitting the road virtually is no substitute for the real thing; my simulation was animated, and I didn't have a physical steering wheel or gas pedal. There was no way for me to accelerate, brake or choose when to merge into a different lane. I felt more like I was along for the ride than in control, but it felt immersive enough to provoke some nervous reactions.\n<br><br>\nFor example, I experienced that familiar pang in my stomach when I noticed a truck approaching in my side mirror. Even though I wasn't in a real car, I felt compelled to keep my eyes fixated on the road in front of me.\n<br><br>\nI didn't even see the other virtual passengers in the back seat until a few minutes into the simulation, because I was so focused on the highway. The pouring rain and sounds of trucks and cars zipping by almost made me forget I was sitting in my office, though it didn't quite feel like I was behind the wheel either.\n<br><br>\nMy experience with Gurr was administered remotely on a headset that costs less than $20 and that used my smartphone as the engine. The goal behind a setup like this is to make the technology as affordable and accessible as possible. \n<br><br>\nBut more robust setups also exist, such as the one used by Dr. Joseph Hirsch, a New York-based psychologist who's published research papers on virtual reality therapy in the American Journal of Clinical Hypnosis. He tells me he's used a vibrating platform with speakers to more accurately simulate the feeling of turbulence when working with patients who are afraid of flying.\n<br><br>\nNot just phobias \nTreating phobias seems like a natural application for virtual reality. Boarding a virtual airplane or staring down from the top of a digital skyscraper is much more vivid than imagining it. Gurr says this level of detail and immersion speeds up the process of overcoming a phobia.\n<br><br>\n<i>\"I could see patients [and after] seven, eight or nine sessions, they're done,\"</i> he said. <i>\"You can't do that in traditional therapy.\"</i>\n<br><br>\nAnd then there are cases where virtual reality provides a sense of escapism or a new type of comfort zone. Monet Goldman, a licensed marriage and family therapist based in California who offers VR therapy, understands this better than most. \n<br><br>\nHe remembers one session in early 2022 when virtual reality was particularly impactful. He was counseling a child over a video call who had completely shut down and was giving only one word answers. But that changed once Goldman and the child began playing a game in VR. Goldman says he was \"completely different.\"\n<br><br>\n<i>\"These are the things he's the best in the world at, and now he gets to reveal that,\"</i> Goldman said. <i>\"He gets to teach me that, and I get to witness this. And it kind of helps their self esteem, their sense of achievement.\"</i>\n<br><br>\nEven those who are well-versed in VR are finding new ways to use it as a stress reliever. Anais Riley, better known by her alias Naysy, who's garnered millions of followers across TikTok, YouTube and Twitch, has used the popular VR dance game Beat Saber to cope with work-related anxiety. It provided just what Riley needed to combat her stressors: physical exercise, a sense of accomplishment, escape from the real world and the opportunity to tap into her childhood interests of music and dance. \n<i>\"I really was just loving playing the game and seeing myself get better,\"</i> she said. \n<br><br>\nBut virtual reality isn't a magic wand for making anxiety and phobias disappear. It's merely another resource therapists can use when providing exposure therapy, a technique that helps people overcome fears by exposing them to phobia-inducing stimuli in a safe environment.  \n<br><br>\nRothbaum likens it to using a real elevator to help address a patient's fear of elevators. <i>\"I'm trained in exposure therapy, and that elevator, I'm going to use it in a different way for every different patient,\"</i> she said. <i>\"So you know, it's just a tool. It's not elevator therapy.\"</i> \n<br><br>\nVR is still waiting for its breakout moment\nThe biggest problem is that people simply aren't using VR on a regular basis. If VR headsets were nearly as ubiquitous as smartphones, therapists would likely be lining up to find ways to incorporate them into their practice. But right now they have little incentive to learn about or invest in VR if their clients aren't using it.  \n<br><br>\n<i>\"The bottleneck has always been the cost,\"</i> says Dr. Albert \"Skip\" Rizzo, research professor at the University of Southern California's department of psychiatry and school of gerontology.\n<br><br>\nShipments of VR and AR headsets are estimated to have reached 9.7 million units globally in 2022, according to statistics from IDC. To put that number in perspective, 300.3 million smartphones were shipped worldwide in the fourth quarter of 2022 alone, according to IDC, even though the market experienced its largest ever single quarter decline.\n<br><br>\nThe arrival of Apple's long-rumored headset, which could debut in June, according to Bloomberg, may help usher in that breakout moment for VR. The head-mounted computer will likely be expensive; Bloomberg reports it could cost around $3,000. But Apple's history of popularizing new technologies like the smartphone, tablet and smartwatch have set the expectation that it could do the same for virtual reality headsets.\n<br><br>\n\"Apple has a way of driving the tide that lifts all boats,\" said Llamas. \"It brings attention, and it brings legitimacy to many of the markets that it enters. And I don't think VR will be different.\"\n<br><br>\nIt's difficult to tell how many therapists and mental health professionals currently offer VR services, but there is some data that can provide a clue. Amelia Virtual Care, which provided the software I used during my experience, has been used to help treat more than 20,000 patients, says founder Xavier Palomer. The software is used by more than 2,000 mental health professionals around the world, according to a company press release.\n<br><br>\nAdam Hutchinson, founder of oVRcome, which provided the software used in the clinical trial Stokes participated in, says his programs have been used in more than 30 countries. \n<br><br>\nGurr also maintains an informal directory of therapists who offer VR services. Roughly 60 practitioners are listed on his website, the majority of whom are located in the US, where psychologists typically need to meet state-specific licensing requirements. The Association for Behavioral and Cognitive Therapies' directory lists 40 VR-equipped therapists.\n<br><br>\nThese numbers pale in comparison to the nearly 700,000 behavioral health specialists in the United States alone, according to data from The George Washington University's Behavioral Health Workforce Tracker. Of that total, 539,714 are counselors and therapists. \n<br><br>\n<i>\"Virtual reality, even though it is effective, is still in its infancy,\"</i> said Gurr. <i>\"And clinicians are kind of reluctant to pick up a technology that either they don't understand or weren't trained in.\"</i>\n<br><br>\nAside from VR being relatively scarce, there's also the learning curve issue. Mental health professionals must take the time to understand virtual reality and learn how to apply it to their patients' or clients' needs. \n<br><br>\nEven someone like Goldman, who grew up playing video games and fondly remembers his Gameboy, practices VR games on his own time so that he can properly engage with his clients.\n<br><br>\n<i>\"[There's] a lot of, I guess you could say, training and education outside of the game itself,\"</i> Goldman said.\n<br><br>\nThe companies trying to make VR therapy more popular\nHutchinson recognizes that it might be quite some time before the general public -- including therapists -- adopts VR on a regular basis. That's why he began with the device most people already rely on every day: the smartphone. Though oVRcome also provides tools that therapists can incorporate into their practice, the company started by distributing VR therapy programs developed by clinical psychologists that anyone can use without a therapists' supervision.  \n<br><br>\n<i>\"That was the goal with oVRcome, was to make treatment for these anxiety disorders using virtual reality exposure therapy easier to access and far more affordable,\"</i> Hutchinson said. \n<br><br>\nParticipants are exposed to a low-anxiety virtual environment when the program starts and gradually progress to more direct circumstances. In Stokes' case, for example, one of the first stages put him outside a virtual vaccination tent, while the final session had him sitting with a nurse ready to administer an injection. \n<br><br>\n<i>\"We really wanted to model how exposure therapy was provided in the clinic,\"</i> Hutchinson said.\n<br><br>\nAmelia's software, which I used during my session with Gurr, is designed to be used under the supervision of a mental health professional. The company's offerings include a VR kit that comes with a headset and an electrodermal response sensor for measuring a patient's sweat response, a VR software platform with access to more than 100 virtual simulations and an app for administering VR therapy remotely. The company also provides training and support materials like an introduction course, tutorials, manuals and marketing guides. \n<br><br>\nXavier Palomer, the founder of Amelia, came up with the idea around 2013 because his friend was afraid of flying. The company was founded in 2014, but Palomer says it hit an inflection point around late 2016, early 2017 as VR hardware like the Samsung Gear VR became more popular. The pandemic also generated more awareness around mental health and self care.\n<br><br>\n<i>\"We are more open to talk about it,\"</i> said Palomer. <i>\"To look for solutions, to actually ask for help.\"</i> \n<br><br>\nAccording to Rothbaum, conventional wisdom says it takes 20 years from when a study comes out for that technology to make its way into public use. If that holds true, VR should've already hit that point. But Gurr sees things a little differently. That timer didn't start in 1995 when Rothbaum and her colleagues published their study. It began when modern VR headsets became cheaper and more widely available.\n<br><br>\n<i>\"Even though virtual reality has been around for a long time, I'm starting the clock at 2015,\"</i> he said. <i>\"Which means we're only in there for seven or eight years.\"</i> \n<br><br>\nAlthough Stokes was familiar with VR, he never considered using it to address his phobia of needles until he came across the oVRcome study. In fact, he wasn't going to seek help for his phobia at all. But now the thought of getting a vaccine or a blood test doesn't bother him in the slightest. \n<br><br>\n<i>\"If I had a needle sitting on my desk right now, I would be completely comfortable,\"</i> he said. <i>\"It's actually remarkable.\"</i>"
},{
  "_id": {
    "$oid": "641793886ec8ef8845120f43"
  },
  "article": "Huawei's New Folding Phone Is Lighter Than an iPhone 14 Pro Max",
  "important": true,
  "author": "Sareena Dayaram",
  "publishing_time": "2023-03-23T03:52:00Z",
  "image": "https://www.cnet.com/a/img/resize/6bc9ac3b58527949ac13de5fff1e4c60a2f03b0c/hub/2023/03/23/a709a4ff-dc06-4939-aad8-6e9b7080a75d/mate-xs3.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The Mate X3, Huawei's latest book-style foldable, was just unveiled in China.\n<br><br>\nHuawei's newest foldable phone, the Mate X3, is an impressively thin and light book-style foldable phone. It was unveiled Thursday alongside the non-foldable flagship P60 series in China.\n<br><br>\nThe Mate X3 has a 6.4-inch cover screen that unfolds to make way for a 7.85-inch inner screen. Despite the presence of two screens, the Mate X3 weighs 239 grams (8.4 ounces) and is 5.3 millimeters thick, making it lighter than the iPhone 14 Pro Max and thinner when unfolded. This also means the Mate X3 is the lightest commercially available foldable phone -- a title Huawei clinched previously with the Mate XS 2. For reference, the Galaxy Z Fold 4, Samsung's version of this type of foldable, weighs 263 grams and has a width of 6.3mm when unfolded.\n<br><br>\nHuawei\nThe Mate X3 also has a free-stop hinge, the company says, allowing the phone to fold into a variety of positions, which lends the device to Flex-mode style features seen on Samsung foldables. The Mate X3 features a circular camera bump housing a 50-megapixel main camera, a 13-megapixel ultrawide camera and a 12-megapixel periscope-style telephoto camera, which is capable of 5x optical zoom. \n<br><br>\nAlthough the slick hardware of the Mate X3 is commendable, one of the biggest upgrades to the Mate X3 is the IPX8 rating, which remains uncommon in the foldable phone segment. Only Samsung's Galaxy Z Fold 4 series has the same rating, which means the means the device can withstand immersion in over 1 meter (3.2 feet) of water. \n<br><br>\nThe camera bump of the Mate X3\n<br><br>\nAnother notable addition is satellite connectivity, which Huawei says can both send and receive messages. The iPhone 14 series was the first major smartphone lineup to permit users to send emergency texts using satellites when outside the range of their mobile network. \n<br><br>\nWith the Mate X3, Huawei has marked its return to the book-style foldable. Last year, Huawei ran with the single-screen wraparound design of the Mate XS 2 instead of launching a successor to 2021's Mate X2. The return to inward-folding design, which Samsung first introduced, seems to indicate that book-style designs are the future for Huawei foldable phones. \n<br><br>\nThe Mate X3 starts at 12,999 yuan (approximately $1,895, £1,550 or AU$2,850) for the base 256GB variant. An international launch is pegged for May."
},{
  "_id": {
    "$oid": "641793916ec8ef8845120f44"
  },
  "article": "How to Buy a Smartwatch: The Biggest Questions to Ask Yourself",
  "important": true,
  "author": "Lisa Eadicicco",
  "publishing_time": "2023-03-24T10:48:00Z",
  "image": "https://www.cnet.com/a/img/resize/4d19c7b623dbc7e1615e2f26304cd4fd19765e72/hub/2022/08/09/3b3c3053-bf19-4aa0-bc59-5107aa395e0f/samsung-galaxy-watch-9792.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "How much do you want to spend? What types of fitness features do you need? These are two important questions to consider.\n<br><br>\nSmartwatches don't come cheap, which is why it's important to choose the right one. Before spending hundreds of dollars on a new device, consider how you intend to use your smartwatch. For example, are you looking for a watch that can help you train for your next race? Or do you only care about meeting your step goal and seeing notifications on your wrist? Most people likely fall somewhere in between. \n<br><br>\nThe good news is that you can narrow down your options with just three questions. Do you use an iPhone or Android device? How much are you willing to spend? And how do you plan to use it?\n<br><br>\nYou'll also want to consider comfort, size and style. After all, a smartwatch isn't very useful if you don't enjoy wearing it. Comfort is especially important if you're looking for a smartwatch to use as a sleep tracker.\n<br><br>\nEarly smartwatches were clunky, expensive and limited in functionality, but there are plenty of worthwhile options on the market today. The best modern smartwatches expertly balance quality design and health and fitness tracking alongside smart features that take some of the burden off your phone. They typically cost anywhere between $200 and $1,000 depending on your needs, but prices will always vary depending on the brand. \n<br><br>\nDo you have an iPhone or Android device?\nAnswering this question will dictate which choices are available. Brands like Fitbit, Garmin, Withings, Fossil and Michael Kors make smartwatches that are compatible with both iPhones and Android phones. But some of our top picks are only compatible with one platform or the other.\n<br><br>\nThe Apple Watch only works with the iPhone, while Samsung's Galaxy Watch 5 and Google's Pixel Watch are only compatible with Android devices. If you're considering the Galaxy Watch 5, know that the ECG feature is only supported on Samsung's Galaxy devices, unless you side load Samsung's Health Monitor app onto a non-Galaxy phone. \n<br><br>\nHow much do you want to spend?\nSmartwatches come in several different price brackets, and finding which one is right for you depends on your budget and what you want from a smartwatch.\n<br><br>\nMost mainstream smartwatches fall around the $300 to $400 range, although you may pay a higher price for extras like LTE connectivity or a fancier finish. These watches provide health monitoring tools, fitness tracking and can replicate some of your phone's functionality. These are the right choice if you want a well-rounded experience, especially when it comes to health and wellness. The Apple Watch Series 8, Fitbit Sense 2, Google Pixel Watch and Samsung Galaxy Watch 5 fall into this category.\n<br><br>\nFeatures will vary depending on the model, but that's the general package you can expect from watches at that price. Some watches have their own specific extras, too. \n<br><br>\nThe $399 Apple Watch Series 8, for example, has car crash detection and an ultra wideband chip that should make it function better as a digital key for your car and home. Fitbit's $299 Sense 2 has sensors that can passively monitor for signs of stress, while Samsung's $279 Galaxy Watch 5 can measure body composition. Garmin's $349 Forerunner 255 has more of a fitness focus, with built-in programs for triathlon and duathlon training. Fitbit and Garmin's watches also typically excel in battery life over watches from Apple, Google and Samsung. The latter, however, offer a larger selection of third-party apps. \n<br><br>\nYou can also find smartwatches that cost around $250, give or take. These watches include many of the features mentioned above, but not all of them. If you mostly want to see notifications on your wrist, make mobile payments, track workouts and don't care much about deeper health insights, this type of watch is the right choice. Watches like the Apple Watch SE and Fitbit Versa 4 are examples of value-priced smartwatches.\n<br><br>\nWhile watches in this price range are usually the right choice for many people, it's important to remember what you're missing. The $249 second-gen Apple Watch SE, for example, lacks an always-on display, ECG, blood oxygen measurements and temperature sensor. But it has the same software, high and low heart-rate notifications, car crash detection, fall detection and selection of exercise modes as the Series 8. \n<br><br>\nThe $229 Fitbit Versa 4 has many of Fitbit's most notable fitness features -- like active zone minutes, sleep tracking, built-in GPS and the daily readiness score (which requires a Premium subscription). You can also get phone notifications and access Amazon's Alexa on your wrist, and it'll soon support Google Maps and the Google Wallet. But you'll need the pricier $299 Fitbit Sense 2 to get Fitbit's more sophisticated health capabilities, like sensors that scan for potential signs of stress, ECG and a skin temperature sensor. \n<br><br>\nGarmin's $249 Venu Sq 2 offers a long battery life (an estimated 11 days) and many health and fitness features for the price (GPS, blood oxygen measurements and sleep tracking). But it doesn't have a speaker or microphone for taking calls, onboard music storage (unless you buy the $299 Music Edition) or access to Google Play Store apps. \n<br><br>\nIt's hard to find new smartwatches that cost less than $200, although there are some options out there. If you want to pay less and don't necessarily care about using apps, you might want to consider a fitness tracker instead. (Fitbit also works with certain insurance companies to provide devices for members, so it's worth checking if your provider offers this benefit). \nHybrid watches\n<br><br>\nHybrid smartwatches are a cross between a smartwatch and a regular wristwatch. These types of watches usually resemble classic analog watches, and therefore lack some smart features you may find on devices like the latest Apple Watch or Samsung Galaxy Watch.\n<br><br>\nFor example, hybrid watches usually have standard, round analog watch faces with hands for the hour and minute rather than color touchscreens. Don't expect to get a full-screen view of your incoming alerts; that's what a regular smartwatch is for. Hybrid watches are designed to be more discrete, so they typically include a small screen located on the watch face for showing notifications and fitness stats. Hybrid watches also usually offer significantly longer battery like compared to standard smartwatches, which is one of their biggest benefits.\n<br><br>\nExamples of hybrid watches include the Withings ScanWatch and ScanWatch Horizon, Garmin Vivomove lineup and Fossil Gen 6 Hybrid. These watches typically cost around the same price as regular smartwatches, meaning you can expect to pay around $150 to $500 depending on the model. A hybrid watch is best for those who prefer the look of classic watches and prioritize having long battery life over smart features like color touchscreens and full app stores.\n<br><br>\nHigh-end fitness smartwatches\nThere's another major smartwatch category to consider: premium fitness-focused watches. These devices usually have everything you'd find in regular flagship smartwatches, but with more rugged designs and additional characteristics aimed at sports enthusiasts. If you're training for a marathon or work in remote environments that may require a more precise GPS signal, one of these watches may be for you.\n<br><br>\nYou can expect to pay between $500 and $1,000 for these types of watches. Garmin's Epix Gen 2 and Fenix 7 Standard start at $899 and $699 respectively, and the new Apple Watch Ultra is available for $799. The $449 Samsung Galaxy Watch 5 Pro falls in between the regular and high-end fitness watch categories. \n<br><br>\nYou may wonder what makes these watches better for fitness buffs than their cheaper counterparts. While the specifics will vary, expensive fitness watches tend to have better durability, longer battery life, more accurate location positioning, customizable buttons and extra features that target specific sports, like running, scuba diving or golf. \n<br><br>\nThe Apple Watch Ultra, for example, has a 36-hour battery life compared to the Series 8's 18-hour battery life, water resistance of 100 meters compared to the Series 8's 50 meters, a depth gauge with a water temperature sensor, dual-frequency GPS, a titanium build, a larger screen and a programmable Action button. \n<br><br>\nCompared to the Forerunner 255, Garmin's Fenix and Epix watches also have increased water durability (100 meters versus 50 meters), lengthier battery life, dual grid mode for showing location coordinates in different formats, customizable hotkeys and an array of golf-oriented features. (The Forerunner 255 still has plenty of running-focused tools, like a race predictor to help with marathon training, since it's largely aimed at runners.)\n<br><br>\nWhen is the best time to buy a smartwatch?\n<br><br>\nThe best times to buy a smartwatch are generally around Amazon Prime Day or Black Friday and Cyber Monday, when the most discounts are available. For example, several Garmin devices were on sale during the July Prime Day, while Fitbit wearables just saw plenty of discounts during Amazon's second event in October. Smartwatches from Apple and Garmin were also on sale during the Black Friday and Cyber Monday period in 2022. \n<br><br>\nIf you're shopping at any other time during the year, the biggest factor you'll want to consider is when the new version of the smartwatch you're interested in might launch. Doing so ensures that you'll avoid paying a potentially high price for a device that may be outdated shortly. Plus, older models may go on sale once the new version launches.\n<br><br>\nShould you buy a smartwatch or fitness tracker?\n<br><br>\nIf you want to spend less than $200 and don't care about features like LTE connectivity, virtual assistants or third-party apps, a fitness tracker could be the right choice. \n<br><br>\nFitness trackers typically provide health metrics like sleep and activity tracking, heart rate, multiple exercise modes and blood oxygen saturation in a smaller (and less expensive) package, but skimp on some smart features like those mentioned above. Since fitness trackers usually have smaller screens, you also won't be able to see as much information at a glance as you would on a smartwatch. \n<br><br>\nBut fitness bands do offer basic smartphone companion features, such as the ability to show call and text notifications and set timers and alarms. Another benefit is that you'll likely get longer battery life from a fitness band than a traditional smartwatch. Check out some of our favorite fitness trackers. \n<br><br>\nBest smartwatches in 2023\nStill not sure where to start when buying a smartwatch? Check out CNET's guide to the best smartwatches for our top picks, which range from below $300 all the way up to $1,000. This year's top picks so far include the Apple Watch Ultra, Apple Watch Series 8, Google Pixel Watch, Samsung Galaxy Watch 5 and Garmin Epix 2 among others. \n<br><br>\nWe test smartwatches by tracking workouts with them, wearing them overnight while sleeping, testing how well they automatically detect exercises, relying on them for notifications when away from our phones and running the battery down to see how long they last. We also take readings from the various health sensors and ascertain what they add to the overall experience. Our goal when testing smartwatches is to assess their overall value by evaluating which features they offer, how well these watches execute those functions and how the whole package compares to the competition.  "
},{
  "_id": {
    "$oid": "641793a66ec8ef8845120f45"
  },
  "article": "Ikea Has a New Waterproof Speaker for $15",
  "important": false,
  "author": "Imad Khan",
  "publishing_time": "2023-03-20T13:02:00Z",
  "image": "https://www.cnet.com/a/img/resize/4dfd4ddf66b037828bed902497476354eae5605f/hub/2023/03/20/b2699f6c-d1e8-451b-bca5-55c02e8e4ee6/ikea-vappeby-ph191961-4e33992a-cropped.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The Vappeby portable Bluetooth speaker has 80 hours of playtime when audio is at 50% volume.\n<br><br>\nIkea, the big-box Swedish furniture and meatball store, continues to expand into the consumer electronics category. Its latest offering is the $15 Vappeby, a portable Bluetooth speaker that's also waterproof.\n<br><br>\nThe speaker, which comes in black, red and yellow, can be paired with another Vappeby, Ikea said in a press release last week. It will have 80 hours of playtime when audio is at 50% volume.\n<br><br>\nIkea says the speaker has an IP67 water resistance rating, meaning it can handle being submerged under water for up to 1 meter (3.3 feet) for up to 30 minutes. But consumers are advised not to test the limits of a device's water and dust resistance, regardless of IP rating.\n<br><br>\nIkea has slowly been expanding into the consumer electronics space since 2012. The company has launched hubs for smart home products, air quality monitors, bookshelf speakers and table lamp-speaker hybrids. While Ikea reported total retail sales of $43.5 billion in 2022, up 6.5% over the year prior, it didn't detail how much came from the sale of consumer electronics. Ikea's strategy with the Vappeby, like with its furniture, seems to be to undercut the competition on price. The Vappeby is cheaper than all of the devices on our roundup of the best portable mini Bluetooth speakers by a decent to wide margin.\n<br><br>\nIkea didn't immediately respond to a request for additional comment."
},{
  "_id": {
    "$oid": "641793b06ec8ef8845120f46"
  },
  "article": "'X-Ray Vision' Could Be the Next Superpower You Get With Augmented Reality",
  "important": false,
  "author": "Jesse Orrall",
  "publishing_time": "2023-03-26T05:00:00Z",
  "image": "https://www.cnet.com/a/img/resize/820ca421b0e52e35a4ae3e1d36a5d753106c2160/hub/2023/03/22/33730a90-a0e9-4370-94c8-86d84c09960f/xar-4.jpg?auto=webp&width=1200",
  "text": "With Microsoft's HoloLens and a special application developed by MIT researchers, AR can be used to find hidden objects.\n<br><br>\nX-ray vision might not be strictly for superheroes much longer, thanks to a new application of a familiar technology.\n<br><br>\nAugmented reality offers a layer of virtual content that usually goes on top of the picture of the world taken in by our eyes, but researchers at MIT are using AR to help us see beyond barriers in a kind of \"X-ray vision\" they're calling X-AR.\n<br><br>\nX-AR is powered by a flexible antenna that adds a sort of \"sixth sense\" to the HoloLens, allowing it to locate specific objects that are outside the wearer's line of sight, as long as they're marked with a widely used item known as a radio frequency identification tag and less than 15 feet away.\n<br><br>\nThe prototype of this system is built as an add-on to Microsoft's HoloLens, but researchers say it could be applied to other augmented reality headsets down the line.\n<br><br>\nThe research team developed their own HoloLens app that directs the wearer toward the desired object and alerts them whether or not the correct object has been picked up using the HoloLens' built-in hand tracking features.\n<br><br>\nPotential applications for this technology right now include use in warehouses, shipping, retail and other places where RFID tags are commonly used. However, researchers say the potential applications of this sort of technology goes much further -- including determining whether food is safe to eat, and aiding search and rescue efforts in the event of a disaster."
},{
  "_id": {
    "$oid": "641793c76ec8ef8845120f47"
  },
  "article": "Best Camera Bag and Backpack for 2023",
  "important": false,
  "author": "Andrew Lanxon",
  "publishing_time": "2023-03-24T09:19:00Z",
  "image": "https://www.cnet.com/a/img/resize/b580057fda515856a3608eb9feacd00010de2670/hub/2023/03/24/7acba77e-3dca-4fac-b403-6629ad4cf89b/gomatic-mckinnon-bag.jpg?auto=webp&fit=crop&height=362&width=644",
  "text": "These are the best photography backpacks, messenger bags and roller cases for carrying cameras in 2023.\n<br><br>\nWhether you're looking for a cheap photography backpack on a budget, a lightweight photo rucksack for heading into the mountains or a stylish luxury camera bag for hiding your camera in at fancy parties, there's a photo bag that will suit. If you're a photographer, you know just how pricey cameras, lenses and other gear can get. And you also know just how important it is to keep your equipment protected when you're on the go. \n<br><br>\nYou certainly don't want to take any chances with your gear, but with such a large market out there, it can be tough to know which bags are best.\n<br><br>\nTo make things easier, I've done the legwork, hand-picking and thoroughly testing a range of great examples from messenger-style bags to adventure backpacks and rolling cases.\n<br><br>\nLowePro FreeLine BP 350 AW\nQuick access backpack for day trips\n$170 at Amazon\nLowePro is known for its affordable, reliable backpacks and its new Freeline is a worthy addition to the range. Its compact size makes it great for day trips or photography excursions around the city, but it's easily big enough to handle a DSLR and two lenses. Access is via side pockets on both sides, which makes it convenient for whipping out your camera when inspiration strikes. \n<br><br>\nI like the look too; it's clearly a photography backpack, but it's more subtle and sophisticated than most, rather than looking like something designed to go up a mountain. It's made of weather-resistant materials that feel more than robust enough to put up with a lot of scuffs when out in the real world. \n<br><br>\nIt'll house a 15-inch laptop and there are straps on the outside to help carry a tripod. With no waist straps, it's not the most comfortable bag for long hikes (at least not when fully loaded), but it's perfectly comfortable as an everyday bag around town. \n<br><br>\nLowePro Trekker Lite BP 150 AW\nLightweight backpack for active days out\n$150 at B&H Photo\n<br><br>\nWith its soft and lightweight design, LowePro's Trekker backpack is a great option if you're heading out for an active day trip. It's comfortable to wear, with a chest strap for added stability, while its rip-stop nylon construction means you don't need to worry about it taking damage when you casually place it on rough ground. \n<br><br>\nInternally the bag features a main storage area with a removable camera insert in the bottom. The insert is small, so don't expect to get more than a small mirrorless camera in there and maybe a spare small lens. It's not a bag for those of you who like to take lots of gear on location. But it leaves room elsewhere for accessories, jackets, sandwiches and whatever else you might need on your fast-paced day out.\n<br><br>\nManfrotto Advanced BeFree Backpack III\nAffordable everyday photography backpack\n$140 at Amazon\n<br><br>\nManfrotto is well-known in the photography world for its tripods, but its backpacks are pretty good too. The Advanced BeFree Backpack III is a no-nonsense affair, with an inoffensive all-black design that hides a wealth of storage options.\n<br><br>\nThe main camera storage space is accessed from the back and comfortably has room for a DSLR with at least a couple of extra lenses. There's additional accessory storage on the top of the bag, as well as expanding front pockets and laptop storage. Side pockets and straps provide space for tripods or water bottles, and the camera storage unit can be removed to use the bag as a regular backpack. \n<br><br>\nThe chest straps aren't comfortable enough for long hikes when the bag is laden with heavy gear, which isn't helped by the lack of waist strap support. That said, for everyday use and day trips with a reasonable amount of equipment on board, it's well-suited for the job.\n<br><br>\nMindShift Gear BackLight 26L\nComfortable and capacious hiking backpack\n$275 at B&H\n<br><br>\nThe BackLight 26L is a compact backpack made for day hikes into the hills, but thanks to the camera storage section, which takes up the entire main section, it can house a lot of gear. I had no trouble getting my Canon 5D MkIV DSLR plus an extra two lenses in. Those of you with more portable mirrorless cameras will have more than enough room for any photography situation.\n<br><br>\nThere are additional pockets for accessories, along with an expandable front section which has enough room to stuff in a packable waterproof coat, just in case the weather takes a turn. The shoulder straps are generously padded, which along with the waist and chest straps makes the BackLight exceptionally comfortable for extended wearing. \n<br><br>\nNomatic Peter McKinnon Camera Backpack\nSturdy, stylish photography day pack\n$335 at B&H Photo\n<br><br>\nI loved Nomatic's larger camera backpack (seen further down this list) for its robust, rubberized outer layer and comfortable shoulder straps. This smaller version shares both those features, along with the cool stealthy black design, but reduces the internal space down to 25 liters. It makes it a superb backpack for day trips, or simply for those of you who want to travel light. \n<br><br>\nIt's a sturdy beast, with fat zips that don't mind rough handling and that thick outer material won't shy away from being thrown in and out of cars, or put down on muddy, stony ground while you get your shot. The internal dividers make it easy to separate out your gear, while expanding side pockets give room for water bottles or tripods.\n<br><br>\nAndrew Lanxon/CNET\nPolarPro Boreal\nLarge-capacity, sturdy camera pack built for tough shoots\n$450 at PolarPro\n<br><br>\nPolarPro has impressed us with its pro-level equipment for photography and video for some time, so it's no surprise that the company's first backpack is a bit of a beast. Made from thick, weatherproof materials with chunky, glove-friendly zips, the Boreal is built to take on the elements and come back unscathed. I've had no problem in chucking it to the ground and throwing it casually into the trunk of my car while its water-repellent coating means it's easy to wipe off mud and grime when you get home. \n<br><br>\nIts large capacity gives a huge amount of room for multiple cameras and lenses, drones, telephoto zooms or whatever else you need to get the shot out on location. The wide, thick shoulder straps mean that even when fully loaded it's still comfortable to carry, while the roll top can expand to accommodate extra jackets. Its sheer size means this isn't a bag for casual day trips, but if you're a serious traveler looking for a camera pack to put up with a tough life, it's well worth considering.\n<br><br>\nMorally Toxic Valkyrie\nSturdy, capacious backpack with a unique design\n$250 at B&H\n<br><br>\nMorally Toxic is a new bag brand from the people behind the tripod brand Three Legged Thing. I've used those tripods for years and have recommended multiple models in my roundup of the best tripods, and I'm pleased that the same eye for quality has been applied to this new bag brand. The Valkyrie has a look that certainly stands out from the usual slew of plain black camera bags on the market, but inside it still offers sensible features like a configurable divider system for securely storing multiple camera bodies and lenses. \n<br><br>\nAt the bottom however is something called the \"frog pocket,\" which is a waterproof section specifically designed for you to store a wet coat in your bag without it getting water all over your pricey gear. It's a neat idea that's worked well on multiple photoshoots across the Scottish countryside, but the pocket can be folded away within the bag if you don't need it. It's comfortable to wear and has mounting points for tripods."
},{
  "_id": {
    "$oid": "6417940b6ec8ef8845120f48"
  },
  "article": "Legacy Blue Check Marks on Twitter Are Going Away Next Month",
  "important": true,
  "author": "Nina Raemont",
  "publishing_time": "2023-03-24T07:39:00Z",
  "image": "https://www.cnet.com/a/img/resize/fd1e3afa6ec7e4ac793505b79866b9279e5da6c3/hub/2022/11/15/83f73850-02b4-44aa-babf-17e26b014b73/twitter-blue-check-orange-2.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "The social media app will begin to wind down its legacy verified program on April 1.\n<br><br>\nTwitter will begin winding down its legacy verified program on April 1, the social media company said in a tweet on Thursday, including removing legacy blue check marks from accounts. \n<br><br>\nThe move comes after Twitter on Thursday said its paid subscription program, Twitter Blue, is now available globally. It was already available in the US and a handful of other countries.\n<br><br>\nTwitter Blue, which costs $8 a month on the web and $11 on iOS and Android in the US, gives users a host of perks on the social media site, including a blue check mark next to their name and the ability to edit tweets and upload higher-quality videos. Companies will pay $1,000 a month for a Twitter Blue in the US. Twitter also says that more features -- like prioritized ranking in replies, mentions and search, as well as seeing few ads -- are coming soon. \n<br><br>\nPrior to CEO Elon Musk's Twitter takeover in October, verified Twitter accounts were free and dedicated primarily to celebrities, journalists, politicians, brands and other notable figures. The transition from free verified accounts to a paid subscription program is one way Musk is attempting to make the platform more profitable. "
},{
  "_id": {
    "$oid": "641796286ec8ef8845120f49"
  },
  "article": "Delete Your Android Web Browser's Cookies, Cache to Quickly Remove Junk Files",
  "important": false,
  "author": "Mike Sorrentino",
  "publishing_time": "2023-03-02T13:43:00Z",
  "image": "https://www.cnet.com/a/img/resize/dfa416d50b962a4e5c87cb59de1eb46bc6151029/hub/2022/03/22/e5edee76-3295-4459-9812-3ececd7c39c2/google-android-7993.jpg?auto=webp&fit=crop&height=675&width=1200",
  "text": "You use your web browser a lot, but you don't need to keep all the files that build up inside that app.\n<br><br>\nYour Android phone's web browser may be filled with tons of data, including files you don't need to keep. Much of that data -- whether you're using Google Chrome, Firefox or Samsung Internet -- gets stored as part of the cookies and cache. This data can be helpful for websites you visit, letting them load faster with your accounts already logged in.\n<br><br>\nWhile those faster-loading speeds are convenient, the cache and cookies are also where data builds up from sites you visited once or twice, along with random data trackers. Some of the cookies track your browsing history and could be helping to serve up personalized advertising based on your web history -- for instance, when you see advertising for a product you viewed briefly on a shopping website.\n<br><br>\nBecause of this, it's good to clear out your cache every so often. It allows you to remove data you don't need on your phone, especially if an unknown data tracker is among your phone's cookies. Clearing your cache is a minor inconvenience -- you'll have to log back into some of your favorite websites, but it's a small price to pay to make sure your phone isn't stocking up on extraneous data.\n<br><br>\nThe steps differ slightly depending on the type of phone and web browser app you're using. Below, we'll go over how to clear this data for Google's Chrome browser (often the default for many Android phones, like the Google Pixel line), Samsung's internet browser (often the default on the Galaxy phone series) and Mozilla's Firefox browser. You can also check out our separate guide on how to clear your cache on an iPhone web browser, in case you have a few Apple devices to tidy up, too.\n<br><br>\nGoogle Chrome\nYou can delete your cookies and cache from within the Android version of Google Chrome by first tapping the More button in the top right corner of the browser, indicated by a column of three dots, then tapping History, then Clear browsing data. You can also access this from the Chrome Settings menu, tapping Privacy and Security and then Clear browsing data.\n<br><br>\nChrome also offers Basic and Advanced settings for clearing your Browsing history, Cookies and site data and Cached images and files. You can use the Time range drop-down to select whether you want to delete the entire history or a selection of anywhere from the past 24 hours up to the last four weeks. Tapping Advanced will also give you access to deleting Saved passwords, Autofill form data and Site settings. After selecting what you want to delete, tap the blue Clear data button. You might receive an additional prompt in the event Chrome deems certain websites as being \"important\" to you, and if so you'll get the chance to confirm before clearing. Otherwise if you do not receive that prompt, Chrome will immediately proceed to clear as you instructed.\n<br><br>\nThere are two different ways you can clear your Samsung Internet browser's cache and cookie data. You can clear from within the browser itself, or you can go through your phone's Settings app.\n<br><br>\nTo clear while in the Samsung Internet browser app, first tap the Options button in the bottom right corner represented by three horizontal lines, then Settings; scroll down to and tap Personal Data, then tap Delete browsing data to get a menu of options to delete. You can clear your Browsing history, Cookies and site data, Cached images and files, Passwords and Autofill forms in any combination. After tapping Delete data, you'll then receive a prompt asking for you to confirm your choices before deleting.\n<br><br>\nGoing through the browser app itself provides the most customization of what you want to delete. However, if you want to access similar options from your phone's settings menu, open the Settings app and tap on Apps, then scroll down to and tap Samsung Internet and then Storage. \n<br><br>\nAt the bottom of Storage, you get separate options to Clear cache and Clear data. Tapping Clear cache will immediately delete the cache, but Clear data brings up a prompt that warns you that all of the application's data will be deleted permanently, including files, settings, accounts and databases. While it doesn't specify cookies, this \"going nuclear\" approach should zap all remaining data, letting you restart the Samsung Internet browser as if it were brand-new.\n<br><br>\nMozilla Firefox\nMuch as with Google Chrome, you can clear the cache from within the Mozilla Firefox Android app. To access this function, tap the More button on the right of the address bar, again symbolized by three vertically aligned dots. Then tap Settings and scroll down to Delete browsing data. \n<br><br>\nOf the three browsers we're discussing here, Firefox gives you the most options under the Delete browsing data menu, allowing you to also delete any existing Open tabs, your Browsing history and site data, Site permissions and even your Downloads folder alongside Cookies and Cached images and files. \n<br><br>\nWhile you can't pick a time range as you can for Chrome, you can be more specific regarding what type of data you would like to remove.\n<br><br>\nAnd Firefox has an additional option for those who never want to keep their browsing data after they're done using the app. Inside of Settings is a Delete browsing data on quit option, which instructs Firefox to wipe any combination of these same settings every time you quit the application. It's a useful feature if you'd like to keep the browser tidy and, say, avoid accidentally handing off your browser history to someone who may have stolen or otherwise gained access to your phone."
},{
  "_id": {
    "$oid": "6420c31799d56c3997b4b5b6"
  },
  "article": "Test",
  "important": false,
  "author": "Test",
  "publishing_time": "2023-01-01T01:00:00Z",
  "image": "",
  "text": "Test"
}]